[
    {
        "id": "1lqx4u1",
        "title": "I feel like I’m lost and don’t want to run this business",
        "score": 3,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lqx4u1/i_feel_like_im_lost_and_dont_want_to_run_this/",
        "body": "So the title is pretty rough and I’m not sure if this is even the right sub, but I need help. So quick explanation I’m 22M and as of right now I moved back in with my dad and started managing /co-owning his newest small restaurant(he owns another that’s doing really well that he also started, and I helped with when I was still in school) so into the problem, the second business is not doing great and I’m starting to struggle with money a little bit, but that’s not the issue the main one at least the main one is essentially I went to a two-year culinary school and since about 1415 I’ve always dreamed of working in the culinary field and having worked for him twice now and in a few other restaurants from everything to Pizza to sports bar steakhouses I’m starting to feel like I kind of hate working in the food industry because even when I had a pretty good, I would say paying steakhouse job. It felt like the only reason I stayed was for the money about a year ago. I was also going to go to college and start a new career path, but basically convinced myself out of it because I have this mentality that this is what I’ve been doing since I was 16 and it’s been my goal to be in food and I just can’t seem to get away from that. I’m going on 22. I don’t know what career path I really want to go down. All I can think about is how peaceful it was when I worked operating forklifts and other warehouse equipment and such and I really regret quitting that job and getting back into food service because I just enjoy the stability of a“ regular stable job” honestly now I know I’m only 22 so it sounds crazy but I don’t know if now is the time to try to drop everything and go back to college or try to get back into warehousing because I remember at the time when I did warehousing, I really wanted to be unlike the maintenance team type people but now I’m honestly just kind of lost in which direction I wanna go.\n\nHonestly, the worst part is I went into this with my dad thinking I would enjoy it and he put down a substantial investment to start a second business that I was gonna handle and now it just seems like the whole thing it’s going south and I constantly am in a state of stress because I feel like it’s my fault and that I should be doing better But even besides all that I just don’t enjoy it as much as I thought I would and I’m scared to mess up the relationship with my dad because I feel like I can’t just walk away from her like any other job and there’s also the part of me that doesn’t know if I even want to walk away but I’m not sure how to talk to him about it. I’m just not sure what to do and I need advice.\n\nTLDR I feel like I can’t get away from food service and I really just want a “regular job“ I can’t figure out how to tell my dad that I don’t really want anything to do with the business that he started in part for me to run because I know he spent a lot of money to get the business rolling, but it’s not doing so well and I don’t want to ruin our relationship money"
    },
    {
        "id": "1lr5cvv",
        "title": "Messed up an ingredient, lost a whole batch of cookie dough",
        "score": 1,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lr5cvv/messed_up_an_ingredient_lost_a_whole_batch_of/",
        "body": "I own a small cookie business, just something on the side with the hopes to slowly scale it. For the first 8 months we had only 2 flavors, and recently we added 4 more to our roster.\n\nTwo days ago, I was in a hurry while making my cookie dough and accidentally used bread flour, which messed up the whole consistency of the dough. During mixing I realized my mistake and tried to adjust by adding more eggs and butter. Apparently, that fixed it... or so I thought.\n\nToday during baking, some cookies completely deflated, some look old, and some are even raw on the inside. One of my cookies I couldn’t even lift up... it would melt between my fingers.\n\nIn other words, I cannot sell these. They just don’t match my quality standards. In total, it’s about 200 cookies, and financially I will take a hit, but I will recover.\n\nMy question is basically: what should I do with all the cookies? I don’t want to give them away to my customers because I don’t want them to get the impression that this is what we will be serving from now on. I also don’t want to throw them away, since they are still food, and some of them (while aesthetically looking like crap) are still edible.\n\nI learned my lesson on the flour and am just trying to find the best solution for these 200 cookies that I cannot sell.\n\nThanks in advance for any advice!\n\n  \nTL:DR; Messed up an ingredient in my cookie, what should I do with 200 cookies that I cannot sell?"
    },
    {
        "id": "1lr408g",
        "title": "County Business License for Virtual Mailbox",
        "score": 1,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lr408g/county_business_license_for_virtual_mailbox/",
        "body": "I'm looking into starting my own LLC and I'm running into trouble finding the answer to this. \n\nI reached out to the local SBDC and they gave the advice to open an LLC and use my home address on everything, then just get a county business license for the county that I live in. I mentioned that I had heard that could be a bad idea because x, y, z... \"Well I've never had a problem\" \n\nSo I started researching using NW Registered Agent for my registered Agent and their Virtual Mailbox service.  My question is do I get a county business license for the county that the virtual mailbox is in (which is halfway across the state)? Do I need one in that instance? "
    },
    {
        "id": "1lqzxkm",
        "title": "Need Help: US Shipments Getting Returned Despite Proper Commercial Invoices (USMCA-Compliant Goods)",
        "score": 1,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lqzxkm/need_help_us_shipments_getting_returned_despite/",
        "body": "We run a small business in Canada and ship products to customers in the US. Recently, we’ve been running into major issues where shipments are being returned back to us for no clear reason.\n\nHere’s what we include with every shipment:\n\n* Commercial invoice with HS codes and country of origin (Canada)\n* Packing slip\n* Our products are made in Canada using US-imported materials, so they should qualify under USMCA and be duty-free.\n\nDespite this, we’ve had several problems:\n\nShipments are returned with the reason “no commercial invoice” — even though the invoice was attached to the box.\n\nSome customers in the US are hit with massive customs charges (e.g., 25% tariffs + UPS brokerage fees) even though the products should be exempt under USMCA.\n\nTo keep our customers happy, we’ve had to either pay these unexpected duties out of pocket or have the shipment returned at our expense.\n\nWe’ve contacted UPS multiple times, but our account manager has been unhelpful and we’re not getting straight answers. It’s costing us time and money, and we’ve got a backlog of returned shipments now.\n\nHas anyone dealt with something like this before?\n\nHow can we make sure UPS properly recognizes our shipments as USMCA-compliant?\n\nIs there a better way to document or flag them to avoid these issues?"
    },
    {
        "id": "1lqvsjc",
        "title": "Basic Zoho Invoice Payment Processing Question",
        "score": 1,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lqvsjc/basic_zoho_invoice_payment_processing_question/",
        "body": "Hi\n\nI am thinking of moving from PayPal to Zoho for invoicing.  However, the thing I can't grasp (I have almost zero accounting skills) is how the money is collected/transferred from credit card (or Venmo or whatever) to my bank account. PayPal collects the money, I initiate the transfer.  How does is work in Zoho?  I see reference to payment gateways, but why switch  - wouldn't  I still have to pay Stripe or Square or PayPal for the processing?\n\nI see Zoho Payments is listed as an option - is that a payment gateway that handles the transfers? Is there a fee?\n\nMoving away from PayPal because of consistent log in problems and Zoho is supposedly cheaper.  I only send about a dozen invoices a month, very small business so the 2.9% + fee makes a difference"
    },
    {
        "id": "1lqvd4m",
        "title": "Just started my own agency, what are some things i should watch out for?",
        "score": 1,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lqvd4m/just_started_my_own_agency_what_are_some_things_i/",
        "body": "Hey everyone,  I’m a younger guy just getting started in business and recently launched my own agency focused on automation and AI. I help small businesses and marketing agencies save time by solving their problems and automating the repetitive stuff\n\nIt’s just me right now so its just trial and error but I know I still have a lot to learn. The tricky part for me hasn’t been the services im selling itself, but it’s been learning how to navigate business, build trust, and communicate value without sounding like I’m just pitching something.\n\nSince I’m new to running an actual business, I figured I’d ask here:  \nWhat are some problems you ran into early when starting your business?\n\nHow did you land your first few real clients and keep them?\n\nWere there any “hidden” responsibilities that caught you off guard?\n\nWhat’s something you wish you focused on earlier instead of wasting time elsewhere?\n\nI’m trying to build this into something real, and I really appreciate any advice or experiences you'd be open to sharing. I’m not here to sell anything, just looking to learn and hopefully help out where I can too. Thanks in advance!"
    },
    {
        "id": "1lr1v1j",
        "title": "What’s the most frustrating recurring problem in your day-to-day work?",
        "score": 0,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lr1v1j/whats_the_most_frustrating_recurring_problem_in/",
        "body": "Just that. What part of your day-to-day business drives you crazy? For me, it’s all the 'sales' hustle."
    },
    {
        "id": "1lqp9cf",
        "title": "Seeking Your Honest Feedback – Help Validate a startup",
        "score": 0,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lqp9cf/seeking_your_honest_feedback_help_validate_a/",
        "body": "‎\n‎\n‎Hey everyone,\n‎\n‎I’d really appreciate your time and thoughts on a startup project my team and I have been building—Sawa Swap—a platform focused on solving a major problem in Rwanda’s agriculture sector.\n‎\n‎What it’s about\n‎\n‎Sawa Swap is designed to connect smallholder farmers with wider markets across the country. In many rural areas, farmers struggle to sell their produce—potatoes rot in fields, milk gets poured away, vegetables go unsold—simply because there are no nearby buyers. Ironically, the same products are needed in other districts, but there’s no efficient way to bridge the gap. That’s the connection Sawa Swap aims to make.\n‎\n‎What we’ve built\n‎\n‎With a background in web development and a passion for agriculture, we’ve developed a functional, test-ready web app using Webflow, Wized, and Xano. \n‎\n‎✅ Sign up as a buyer or seller\n‎✅ Receive a confirmation email\n‎✅ Add products to cart and place orders (use test OTP: 123456)\n‎✅ Sellers can upload products to the marketplace\n‎✅ View products, orders, payouts, and account settings in your dashboard\n‎✅ Use sorting options on the marketplace page to explore available items\n‎\n‎Why I'm reaching out\n‎\n‎We haven't officially launched yet, but the platform is launch-ready. Now we need genuine, on-the-ground feedback.\n‎\n‎Have you faced or seen the same challenges we’re tackling?\n‎\n‎What would you improve in the platform or idea?\n‎\n‎Does this resonate with what’s happening in your area?\n‎\n‎\n‎Please keep in mind: since we’re on Xano’s free tier for now, the site may temporarily slow down or require a refresh if many people access it at once (it’s limited to 10 requests per 20 seconds).\n‎\n‎Also...\n‎\n‎If you’re interested in partnering, sponsoring, or even co-founding this with us—we’re open to conversations.\n‎Or, if you’re ever in need of a skilled web development team to build high-quality websites or full-scale web apps, we’ve got you covered there too.\n‎\n‎Thanks for reading, and again, any feedback is hugely appreciated.\n‎\n‎The platform's link can be found on ma profile."
    },
    {
        "id": "1lqntux",
        "title": "How do we scale as a Junk Removal Business?",
        "score": 0,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lqntux/how_do_we_scale_as_a_junk_removal_business/",
        "body": "We are a junk removal business who have been operating for about 4 months now - business is starting to pick up and we are beginning to make some decent money. Now we have our eyes set on expansion, buying back our time and focusing on growth. **Our greatest problem right now** is lead generation, here is how we currently generate leads.\n\n1. Google ads (we have a marketing agency) is slowly but surely growing - as is our SEO ranking + Google Business Page reviews. I have a decent amount of faith in our growth in this area but I am aware it will take time. (Local Service Ads are not available in Australia)\n2. Flyers (simple handing out flyers, not scalable, we hand them out - labour could be potentially worth it though)\n3. Facebook marketplace + Community groups. This is also limited in scalability.\n\n**What we need advice on is how to scale our lead generation any and all ideas are welcome!**\n\nUpvote1Downvote0Go to comments  \n"
    },
    {
        "id": "1lq6e21",
        "title": "Can I Refuse to Quote a Customer When My Product is Specified by Architect?",
        "score": 17,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lq6e21/can_i_refuse_to_quote_a_customer_when_my_product/",
        "body": "I have a small manufacturing business that makes commercial construction products. We have a contractor customer who has been such a pain to deal with (late payments, screwed up orders where we eat the cost, terrible communication, blaming problems they created on us) that we recently decided we don't want to quote them on projects anymore.\n\nHere's the tricky part--architects specify our products in some projects that go out for public bid, meaning if this customer wants to bid on a project wherein our product is in the architectural plans, they have to get a quote from us. Or they need to try to get a substitute product approved.\n\nMy question is this: is there anything that would prevent us from refusing to quote this contractor from a legal standpoint?\n\n  \nTLDR: can I refuse to quote or sell to a customer for a public bid project? There is no discrimination involved."
    },
    {
        "id": "1lpwfec",
        "title": "What's the job title of a person who just brings clients and takes commission?",
        "score": 9,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1lpwfec/whats_the_job_title_of_a_person_who_just_brings/",
        "body": "Hey Reddit,\n\nI'm hitting a wall with my design company and need some advice.\n\nWe're a small design company team based in a developing country in Europe, and we specialize in digital stuff—social media designs, websites, and branding. \nLife’s alright, we’ve worked with some big clients, but I still feel like I should be making more.\n\nWe’re actually really good at what we do, especially with latest tech. Honestly, probably one of the best around here. The problem over here it’s more about who you know than how good your work is. We don’t have time (or interest) to go out for dinners or kiss people’s asses just to get work. We just wanna work and get paid.\n\n\nMy brother-in-law has an architecture firm and works with this guy in Australia who just brings him clients and takes a 30–50% cut. It's a simple, perfect deal. They both win.\n\nI'm looking for a similar setup, but for a design company.\n\nOur prices are fair. Not $10K per logo or site, but also not cheap $50 ones either. We’re even down to do a free sample just to show what we can do.\n\nSo... is there a name for this type of person — someone who just brings clients and takes a cut? Do people like this even exist for creative businesses? And where do I even find someone like that?"
    }
]