[
    {
        "id": "1e32fj4",
        "title": "I made a fast, simple and privacy friendly alternative to MyFitnessPal",
        "score": 219,
        "url": "https://www.reddit.com/r/SideProject/comments/1e32fj4/i_made_a_fast_simple_and_privacy_friendly/",
        "body": ""
    },
    {
        "id": "1gbtcp1",
        "title": "I always dreamed of an Airbnb alternative to find cheaper apartments to rent so I built it myself",
        "score": 158,
        "url": "https://www.reddit.com/r/SideProject/comments/1gbtcp1/i_always_dreamed_of_an_airbnb_alternative_to_find/",
        "body": ""
    },
    {
        "id": "1k507oh",
        "title": "I built a Typeform alternative and just crossed 8,000 users + $18K revenue",
        "score": 116,
        "url": "https://www.reddit.com/r/SideProject/comments/1k507oh/i_built_a_typeform_alternative_and_just_crossed/",
        "body": "Hey everyone! Just wanted to share a quick update on my side project, [Buildform.ai](https://buildform.ai/) \\- a modern form builder we built as an alternative to Typeform, focused on conversion-first forms, smart logic, and AI-powered workflows.\n\nWe did it the “wrong” way. Instead of launching early and iterating, I spent months obsessing over getting everything *right* — bug-free, fast, production-ready. Honestly, I was shit scared it might flop. But turns out, people really appreciate a forms app they can rely on.\n\nSome highlights:\n\n* **AI Form Builder**: Just type what you want and boom, form done\n* **Partial Submissions** \\+ Analytics: See drop-offs, optimize based on data\n* **Logic Editor** that actually works\n* **AI Logics Builder** (coming soon): No more tangled logic flows, it writes them for you\n* **DeepOptimize** (coming soon): AI that auto-fixes your forms for better conversion\n\nWe’re at $18K in revenue and over 8,000 users now. Still early, but the feedback has been incredible. If you’re building forms for lead gen, customer onboarding, or internal tools, would love for you to try it out or tear it apart.\n\nAppreciate any thoughts or feedback. Always happy to trade notes with other builders!"
    },
    {
        "id": "1ef9o77",
        "title": "How to launch your projects really fast and save money [based on 10+ products that I built]",
        "score": 88,
        "url": "https://www.reddit.com/r/SideProject/comments/1ef9o77/how_to_launch_your_projects_really_fast_and_save/",
        "body": "Hey, I'm [Morgan](https://x.com/m_0_r_g_a_n_). Here is [my last post](https://www.reddit.com/r/SideProject/comments/1e5tlnh/what_i_learned_from_4_web_apps_i_built_for_the/),[ ](https://www.reddit.com/r/SideProject/comments/1e5tlnh/what_i_learned_from_4_web_apps_i_built_for_the/)where I described how it's tough to build side projects. But today, I want to share what I learned from building so many projects in the past years, including how you can build your products faster and save money.\n\n# DESIGN DOESN'T MATTER ANYMORE\n\nIn 2024, you will definitely use everything possible to speed up your development. Nowadays, there are so many good frameworks, templates, boilerplates, and assets that it's almost impossible to make a bad design that will affect your sales or marketing. Don't go pixel-perfect \\[no one cares\\]; don't spend days and weeks picking a page layout or button color. It just makes no sense. You, one person, it's **NOT POSSIBLE TO HANDLE EVERYTHING BY ONE PERSON**, period.  Focus on how you can deliver MVP ASAP and get your first real feedback, then iterate.\n\n# BUILD MVP ASAP\n\nDevelopment doesn't matter anymore as well cuz AI has arrived. Almost anyone can build an MVP, maybe not like you, in a few days, but they can do it in a week or two.\n\nBelieve me, you will have plenty of time after the launch to add more features, change your copy, change your design, etc. It rarely happens that you launch, and the next day, you have 10K users. Early launch and early feedback will give you the exact direction that you need to work next. Complaining users or feature requests will give you the drive to work on the project after weeks and months of silent development.\n\n**How do you build MVP fast, you may ask? I'm glad you asked!**\n\n1. Use the tech stack you know the best. It makes no sense to learn something completely new if it's doing the same thing or because it's a trendy framework.\n2. Pick one main feature to start with and build it. Don't try to build the whole set of features from the start! You need more traffic, not more features!\n3. Use everything you can: boilerplates, templates, AI, and frameworks. Your product, feature set, design, and everything will be so different in a year of active development that the initial app itself will no longer matter. **YOU CAN REBUILD IT LATER IF NEEDED** \\[never happen 😁\\]\n4. Use third-party apps as much as possible: RESEND, Vercel, AWS, OpenAI, or whatever you need. It's much cheaper to pay $20/month than to spend 100 hours building a copy of that functionality yourself if you could buy it. **IF YOU CAN BUILD SOMETHING, IT DOES MEAN THAT YOU SHOULD.**\n5. There are a lot of free/open-source alternatives out there that could speed up your development!\n\n# CONTENT STILL THE KING\n\nCopy on your landing page, and your message are still much more valuable than design \\[until you sell design services, lol 😂\\]. Spend some time on a good copy, use ChatGPT, use freelancers, and get feedback from friends. But again, make your first copy, get some traffic, get feedback, and adjust your texts based on the feedback. You can create landing pages per feature, blog posts, knowledge bases, help centers, etc.\n\nIf you do PPC, focus on landing copy first. If SEO is your goal, it's a long-term game that takes time \\[weeks and months\\]. You can start with low-comp keywords, free tools, and blog posts \\[how-to's, Best X for Y, N Alternatives to, etc.\\].\n\n# TRY TO GET FREE CREDITS\n\nThere are a lot of opportunities to get free credits.\n\n1. Apply to [https://foundershub.startups.microsoft.com/](https://foundershub.startups.microsoft.com/)  to get $2500 free credits for OpenAI, $150K in Azure credits, and many more.\n2. Apply to AWS (https://aws.amazon.com/startups) via some partners ([https://founderpass.com/)](https://founderpass.com/) and get $5000 in credits. Founder Pass has many more partners with free credits, such as Cloudflare and Google Cloud.\n3. Intercom, Crisp, and others have free or almost free plans for the first year of paid membership.\n\nAnd many, many more. As you are on a tight budget, all those free credits will help you a lot!\n\n# SUMMARY\n\nDon't spend too much time on MVP because you will burn out without users' feedback, and it just makes no sense to build something into the void. Save as much as possible, try to get free credits or use open-source. Buy services if you see that you can save and speed up.\n\nGOOD LUCK!\n\nP.S. If you have any questions I will be glad to answer here in the comments or in DM. AMA."
    },
    {
        "id": "1krzp2a",
        "title": "From 0 to 550 users in 19 days with my open-source project",
        "score": 88,
        "url": "https://www.reddit.com/r/SideProject/comments/1krzp2a/from_0_to_550_users_in_19_days_with_my_opensource/",
        "body": "Open-launch, my open source alternative to Product Hunt, just hit 550 users, only 19 days after launch.\n\nRevenue: $260 || DR growth: +18 || 100–200 unique visitors daily\n\nFor context: my previous project took 6 months to reach 550 users.This feels surreal.  \nhere is the project: [https://open-launch.com](https://open-launch.com)"
    },
    {
        "id": "1ldfx0z",
        "title": "My side hustle Dictation tool achieved a big milestone, emotionally 😭",
        "score": 85,
        "url": "https://www.reddit.com/r/SideProject/comments/1ldfx0z/my_side_hustle_dictation_tool_achieved_a_big/",
        "body": "I started developing pain in my arms because of typing. Tried the dragon, mac's inbuilt tools, but was not satisfied because of :-\n\n1. Low transcription accuracy.\n2. No formatting.\n3. No punctuation or grammar support.\n4. Doesn't support custom words. \n\nI took the matter in my own hands with the aching arm. Developed a product that checks most of the above issues. Started giving it to a few users. My heart swelled with joy when I received this review from a Reddit user. It motivated me to share more.\n\nAlthough it started as an alternative to stop typing when in pain, I gradually found myself using it a lot throughout the day, even when my hand is not paining. \n\nI'm sure it will be productive for you guys as well. Do give it a try. It is called Dictation Daddy. "
    },
    {
        "id": "1lby180",
        "title": "Up to $1300 mrr felt like sharing my ai product story",
        "score": 64,
        "url": "https://www.reddit.com/r/SideProject/comments/1lby180/up_to_1300_mrr_felt_like_sharing_my_ai_product/",
        "body": "Been on Reddit for two years and never post, just browse I hate the attention seeking. But this could give others hope. I was in a pretty dark place (very) working a 9-5 with no hope everything I tried failed. I couldn’t even get $5 mrr with anything I did.\n\nI’m not super far in life and this is small but figured sharing could help someone out there. I’m not going to write the name or site of my company because this isn’t an ad. It’s a ai transcription software.\n\nI’m a software developer so writing software is something I did naturally from experience. \n\nFirst think I signed up to the Amazon https://aws.amazon.com/partners/programs/global-startup/ program where I got free credits can prob google it. I used polly for the mvp. I didn’t have a lot of extra income so this was a big help. \n\nI then started building up seo I had zero money for ads and even if someone gave me the code for Facebook, it’s all a matter of getting user code quality doesn’t matter if there’s no money. I used a tool called https://fantail.ai which connected to my Google\nConsole and wrote a blog everyday on autopilot based on what my site was ranking for. Again I focused on free tools and after a month was getting 100 click on just blogs. I used a free version of https://sanity.io cms which actually holds the blogs as manages the schema.\n\nI connected the subscriptions to stripe and saw a spike. A few hundred dollars honestly felt like a million. I don’t know alternatives to stripe maybe there are better ones. I didn’t have to signup or register a business as you can start as a sole trader. I’m based in Australia so not sure how USA laws work there .\n\nSo 2-3 months later it’s up to 1.3k (btw I priced everything in USD not sure if that’s best practice) but happy to answer any questions or help.\n\nHonestly, small things in life can save someone’s future so any positivity happy to help with. The tool itself is super simple and I will soon migrate it to a fine tuned model. Maybe I can also share my experience with training ai in the cloud with rented gpus. So far churn has been 10%"
    },
    {
        "id": "1hyfqxl",
        "title": "I got my first 3 sales (in less than 24 hours)",
        "score": 60,
        "url": "https://www.reddit.com/r/SideProject/comments/1hyfqxl/i_got_my_first_3_sales_in_less_than_24_hours/",
        "body": "Hey everyone, I’ve recently launched my solo side project [NextUpKit](https://www.nextupkit.com)   \nAnd got my first 3 sales within 24 hours! 🎉\n\n(2 of them are from a waiting list, one from socials)\n\nThe challenge now is marketing, how to find my audience and more people to pay for it. The project I've built is a much cheaper alternative to competitors, so how to target the developers who are willing to pay for the much expensive options.\n\nWhat strategies can I use to highlight the cost advantage? Ads? SEO?\n\nI’d love any tips, feedback, or ideas on how to do that. \n\nHuge thanks for any help ☺️"
    },
    {
        "id": "1hd92r0",
        "title": "I built a Udemy, Teachable, open-source alternative to make and sell courses online with no fees",
        "score": 43,
        "url": "https://www.reddit.com/r/SideProject/comments/1hd92r0/i_built_a_udemy_teachable_opensource_alternative/",
        "body": ""
    },
    {
        "id": "1iu30m6",
        "title": "I built a free and open-source alternative to OpenAI's $200/month Deep Research",
        "score": 47,
        "url": "https://www.reddit.com/r/SideProject/comments/1iu30m6/i_built_a_free_and_opensource_alternative_to/",
        "body": ""
    },
    {
        "id": "1ilyycg",
        "title": "What's your 'I wish there was an app for that' moment? I'll build the best idea!",
        "score": 40,
        "url": "https://www.reddit.com/r/SideProject/comments/1ilyycg/whats_your_i_wish_there_was_an_app_for_that/",
        "body": "  \nHey Folks! 👋  \nI'm a developer looking to build something genuinely useful. Instead of guessing what people need, I thought I'd ask directly: what's that recurring problem or annoying situation in your life where you've thought \"why isn't there an app for this yet?\"\n\nCould be anything - a daily inconvenience, a process you wish was automated, or something you're currently solving with a messy workaround. No problem is too small or too niche!\n\nPlease share:\n\n1. Your problem/situation\n2. How you currently handle it\n3. Why existing solutions (if any) don't work well"
    },
    {
        "id": "1jn6z2q",
        "title": "We hit #1 on Hacker News last week - just launched on Product Hunt!",
        "score": 30,
        "url": "https://www.reddit.com/r/SideProject/comments/1jn6z2q/we_hit_1_on_hacker_news_last_week_just_launched/",
        "body": "Last week we launched Openspot, a modern, no-BS alternative to LinkedIn, and it unexpectedly blew up  \n✅ #1 on Hacker News  \n✅ 450+ comments  \n✅ 20k+ visitors  \n✅ 1k+ sign ups\n\nToday we’re launching on Product Hunt 🚀  \nWould love your feedback (or support) if you’ve ever felt invisible in the job hunt grind:\n\n👉 [https://www.producthunt.com/posts/openspot-3](https://www.producthunt.com/posts/openspot-3)\n\nWe’re still super early: bootstrapped, raw, and iterating fast.  \nLet me know what you think, and what you’d do next if you were in our shoes 👀"
    },
    {
        "id": "1krtjvp",
        "title": "I Built a YouTube Alternative to Help My Kid Avoid Screen Addiction – Update",
        "score": 29,
        "url": "https://www.reddit.com/r/SideProject/comments/1krtjvp/i_built_a_youtube_alternative_to_help_my_kid/",
        "body": "Hey fellow devs and parents,\n\nWe managed to keep our son completely screen-free for his first two years—no TV, no phones, no YouTube. As he got older, we gradually introduced some carefully chosen videos: slow-paced documentaries, classical music performances, and older, calm animations with meaningful storytelling. But even with strict supervision, YouTube itself became a problem.\n\nEven when I chose the video myself, the homepage and recommendations bombarded him with flashy, hyper-stimulating thumbnails. Something I didn’t want him to see. And YouTube Kids wasn’t an option (not available in our country), but honestly, YouTube Kids and other similar apps are algorithm-first platforms, filled with overstimulation, and not designed for calm, intentional viewing.\n\nI wanted an app that starts from **zero content**, and only shows what I explicitly added.\n\nSo I built [**GoodTube**](https://goodtube.io/) — a lightweight, YouTube-style app with a single goal: **total control over what’s watchable**.\n\n# What Makes It Different\n\n✅ No recommendations or “Up next” autoplay  \n✅ No YouTube links or external redirects  \n✅ No thumbnails designed to bait clicks (unless you yourself add that type of content)  \n✅ Just your approved YouTube videos, playlists, and channels\n\n✅ Available as PWA for app like experience\n\nYou go to the Add page, paste a link to any YouTube video, playlist, or channel, and it appears in your own curated “My Feed.”\n\nI also built a small blog section where I write short posts about YouTube hidden gems—beautiful lullabies, gentle music, slow nature docs—things that are truly worth watching and co-viewing with your child. For example, you might read aloud to your kid a quick story about an obscure Scandinavian lullaby and then watch a peaceful performance of it. It’s designed to be a slow, mindful experience.\n\n# How It Works With My Son\n\nMy son is now a little over three. When he asks to watch something, I open GoodTube, and he scrolls through a calm, minimal interface. No cartoons by default. Sometimes he picks a music video or documentary. Often, he gets bored within a few minutes and moves on to play with his grandma or paint. That’s a **huge win** for us. I believe this setup might work well until kids are about 5, when they actively seek stimulation.\n\nSome other users have mentioned it also helps them detox from YouTube as adults—for example, to watch yoga or meditation playlists without algorithmic distractions.\n\n# Technical Notes\n\n* **Frontend**: Next.js + React\n* **Backend**: Firebase (Firestore)\n* **Hosting**: Vercel\n* Public pages (blog, homepage) are statically generated. User feeds and features are client-rendered for simplicity.\n\n# Why I Built It\n\nGoodTube isn’t meant to compete with YouTube or become another platform. It’s the opposite—it’s meant to **decrease screen time**, not extend it. If your child gets bored and walks away, that’s a feature, not a flaw. It’s not supposed to be convenient, addictive, or “sticky.” Your kids watches a video, that’s it, no auto play, you either close it or specifically navigate to another video. Done.\n\nI’d love feedback, ideas, or to hear from others trying to manage screen habits for their kids. This started as a personal tool, but if it helps even a few other families, I would like to spread it.\n\nCheck it out: [https://goodtube.io](https://goodtube.io/)\n\nLet me know what you think. This post is an update to my previous [post](https://www.reddit.com/r/webdev/comments/1j0blfl/i_built_a_youtube_alternative_for_my_kid_to_avoid/)."
    },
    {
        "id": "1jzndkr",
        "title": "We made a European product recommendation website with a few redditors and received over 300K visitors in two months!",
        "score": 30,
        "url": "https://www.reddit.com/r/SideProject/comments/1jzndkr/we_made_a_european_product_recommendation_website/",
        "body": "So, the last two months have been pretty wild!\n\nOn 21 February I saw that u/rosiutza had posted a prototype of a website to help people discover European products on r/buyfromeu , so I shot her a message. Today we are working with over 60 volunteers, are getting 10-20K visitors a day, and have manually verified over 2000 product recommendations.   \n  \nSo far, we've been featured in over 30 newspapers all over Europe, and we are currently getting emails from publications in Japan and Korea!\n\n**What are we doing?**  \nGo European is a platform that helps you discover European products and services. We have a bunch of filters that help you search by category, country, or non-European products that you are looking for an alternative to. The search bar is pretty powerful too, helping you search by brand names (e.g. PUMA), subcategory (e.g. toothpaste, socks), country, or products you are looking for an alternative to (e.g. Google Meet).   \n  \nUnfortunately, it doesn't allow for multiple keywords that are not connected. Every product card links to its own product page and to the product website as well.\n\n**Why did it take off like that?**  \nHonestly, the response has been amazing and overwhelming. I think our project has gotten so far in so little time because we were at the right place at the right time, and had a super fast-growing community behind us ( r/buyfromeu ) to keep up momentum as we were working on it. A few months earlier, we wouldn't have made the same waves I am sure, but given recent political developments, there is a lot more openness to and interest in European products than there used to be.\n\n**So are you boycotting US products?**  \nNo, we are all about promoting European products and services, not disparaging products from other places. We do offer European alternatives to non-European products, simply because that's how many people look for European products. They don't search for \"European website where you can find and book other people's houses\"—they search for \"European alternative to airbnb\".\n\n**How we built it**  \nOur website is made with the no-code tool Softr hooked up to an airtable base (not European, we know). In the background, a group of devs is working on an open source V2 (React / NextJS) that doesn't require paid 3rd party tools to work.\n\n**What are we working on now?**  \nAs I mentioned, we are working with a large community of volunteers who are doing a million different things, from developing a new website from scratch, to verifying community-submitted products, developing a social media strategy outside of reddit, partnerships etc. \n\nI am personally working a lot with the data verification team and on the temporary website. One of the things I am quite excited about is hooking up the website to databases like Good On You, which rate fashion and beauty companies on their sustainability based on over 1000 data points. I feel strongly that this project is about more than hyping up European businesses, and should help people consume consciously by giving them clear and good information.\n\n**What is it like to work with over 60 volunteers?**  \nThis is my first time co-leading a large scale community project and I am learning so much. A few years ago, I wrote an article about the open source 3D design software Blender (Dutch!) and I remember vividly how its founder Ton Roosendaal said that you cannot really steer the community. They are going to go where they want to go. \n\nThis has been very true so far, and I've learned to accept and love it. For example, we've had the same stock images that come with Softr on the website for 2 months and I hate them. Any attempt to come up with an alternative with our designers has not (yet) yielded into a result we all like, and so the images have stayed on for now.   \n  \nOn the other hand, people appear out of the blue to build python scripts to scrape information from wikipedia to enhance the quality of our database, or single-handedly verify hundreds of products which must've cost days. And that's just the data team. \n\n**What's next?**  \nWe have some exciting partnerships in the pipeline with some brands that noticed a bump in their traffic through our website.\n\nAlso, we are partnering up with BrandSnap who are building an app that lets you take photos of products to tell you where it's from and recommend European alternatives.\n\n"
    },
    {
        "id": "1i3chlg",
        "title": "I've reached 400 downloads and $60 in sales!",
        "score": 27,
        "url": "https://www.reddit.com/r/SideProject/comments/1i3chlg/ive_reached_400_downloads_and_60_in_sales/",
        "body": "While it might not seem like a huge milestone, launching my own app on the App Store and achieving this in just a month and a half feels like a big win. I’m incredibly grateful for the support and motivated to keep pursuing my dream of becoming an indie developer.\n\nFor me, this journey isn’t about maximizing sales or making tons of money—it’s about offering an affordable alternative to the overpriced productivity apps out there. And honestly, I believe my app is better (yes, I might be a little biased 😄).\n\nIf you're interested, you can visit the App on the App Store - it's called Screenless. You can DM me, if you want a free promo code!\n\nThank you to everyone who’s been part of this journey so far! 💙\n\n[Screenless Sales](https://preview.redd.it/urfceeh8tide1.png?width=1088&format=png&auto=webp&s=6d38bbaf8ed93bb6f0cef89f722cc780cd51fa5d)\n\n[Screenless Downloads](https://preview.redd.it/mkq33bmftide1.png?width=1271&format=png&auto=webp&s=f41b642ccd3ae051fedb88b189cc10b278495316)\n\n"
    },
    {
        "id": "1jmqlpc",
        "title": "I built Foqos, an open source and free way to block those distracting apps",
        "score": 25,
        "url": "https://www.reddit.com/r/SideProject/comments/1jmqlpc/i_built_foqos_an_open_source_and_free_way_to/",
        "body": "Foqos allows you to block apps behind a scan of a QR code, tap of an NFC tag or manually toggling in the app! Check it out here: https://www.foqos.app/\n\nThis is a total alternative to all those crazy expensive physical blocking apps. Best part its completely open source and will always be free! There is an affiliate link in the app for nfc tags and donations are completely optional\n\nYou can even view the code here: \nhttps://github.com/awaseem/foqos\n\n"
    },
    {
        "id": "1jkii48",
        "title": "14 Mistakes I Made While Building a SaaS (So You Don’t Have To)",
        "score": 25,
        "url": "https://www.reddit.com/r/SideProject/comments/1jkii48/14_mistakes_i_made_while_building_a_saas_so_you/",
        "body": "I've been building my SaaS for 129 days. Here's a NO-BS list of mistakes I made (and lessons I learned)\n\n# 1. Prepare legal ground\n\nHave an LLC or some other legal entity so you can collect payments and bypass limitations you'll most definitely run into, if not on this SaaS, then on the next one.\n\nI didn't think about it until I faced APIs such as Meta API or Stripe which required a legal entity. You can always open an LLC remotely in USA, there are many companies that provide this service. It will typically cost you around $500. If you want recommendation on a service I used, DM me.\n\n# 2. Analyze the market and your competitors before committing your resources\n\nI didn't analyze the market properly. I looked at 4-5 big competitors and their features and that was it. As I kept building, I encountered more and more competition in the space, and it wasn't until the 4th month that I fully realized how crowded this space really is.\n\nTo be fair, I didn't know how to do proper research.\n\nIf I were starting over, here's what I'd do:\n\nGo to AlternativeTo\n\nSearch your top 5-6 competitors\n\nCompile all their alternatives into a table\n\nHere you go, this is your competition. It will include big names as well as small indie hackers like yourself. Study them and figure out where you fit.\n\nIf you still want to continue, move on.\n\n# 3. Select a dead domain name\n\nI was careless with my first name. At the end of 3rd month I had to bite the bullet and spend a few days to re-brand everything, and to start the SEO game from scratch.\n\nMake sure the name you're selecting is a dead name. Nothing significant should appear on Google. Make sure the social media handles for this name are available. Make sure there are no other services, especially in the same niche, that have a very similar name.\n\nBrainstorm the name with ChatGPT. Brainstorm the name with friends. It's easy to get attached and get biased toward a name. You need 3rd party view on this.\n\n# 4. Start with a Waitlist\n\nSetup simple UTM and Referral tracking.\n\nAsk for the name so later you can make the emails more personalized.\n\nBare minimum for your waitlist: target audience, feature list, \"how it works\", and FAQ.\n\nYou can start with just text. When you have something to show, put a screenshot/video there.\n\nAdd \"Welcome\" email to the waitlist. As such, you 1) warm up the mailbox and 2) you can see if any emails bounced.\n\nPromote the waitlist on reddit/linkedin/X. Best source for me was Reddit. You can promote even on subreddits which do not allow promotion, if you do it smart. I made some posts on subreddits without including a link to the waitlist, and people reached out to me via DMs asking for a link.\n\n# 5. ENGAGE WITH YOUR WAITLIST\n\nSeriously, just do it. Those people signed up. Every week you make something new, you can share it with them. Send a biweekly update on the progress.\n\nI kept silent for 2.5 months before I engaged the waitlist. And when I finally did, what happened? Crickets...\n\n# 6. Choose proven stack\n\nPut your ego aside. Seriously. Just choose what works.\n\nI spent so much time simply because my stack was not optimal. In particular, Vue and Nuxt, which I use, are great frameworks, but they lack in community.\n\n# 7. Choose an SSR framework for landing page\n\nThis one may be obvious to some, but it cost me a week separating my landing page from the app so I can get SEO benefits. Don't be me.\n\n# 8. Choose proven hosting\n\nI spent several days to relocate my backend from fly.io to render.com because fly.io turned out to be ridiculously slow.\n\n# 9. Start the SEO game early\n\nWarm up your domain authority. Spend a few days to submit your Waitlist/MVP into directories. Write/generate SEO friendly high quality articles. Optimize your landing and blog page for SEO.\n\nThere is absolutely no reason to not invest a few 2-3 days into it early on unless you're still in the experimentation phase.\n\n# 10. Once your MVP is out, you will get at least a few regular users. Engage with them\n\nListen to what your users say. Engage with them. Ask how they are doing. Ask for improvement ideas. Ask for feedback. Check up on them from time to time. You first 5 users are very important. When you fully release, consider leaving them as free users. They will become your cheerleaders.\n\n# 11. Do not code. Instead, PLAN\n\nThink like an architect. Only code to validate hypotheses or prove something works, but once it does, don't rush into building the full ap. Pause. Design first.\n\nLook, these days AI writes 80% of the code. But it doesn't know your vision. If you don't plan the big picture, you'll end up refactoring endlessly.\n\nStart with your data model. Seriously, I spent weeks reworking mine. And I've had plenty of smaller refactors that could have been avoided had I put more thoughts into planning.\n\nThink. Plan. Then build.\n\n# 12. Do not waste time on UI\n\nJust accept that your MVP UI does not matter. When the time is right, you will change it anyway. Don't spend time on the UI on the first version of the app. Just make it simple and clean, but don't overdo it.\n\n# 13. Look for out of box solutions when possible\n\nI spent 5 days developing custom billing portal only to find out that Stripe provides it out of box. It took me less than 2 hours to integrate the OOB one.\n\n# 14. Simplify, simplify, simplify\n\nCan't emphasize this enough. I know this is hard. Your backlog will grow. You'll have more and more ideas. But you have to stay razor sharp. Focus on one specific problem. Whenever you can, look for short cuts.\n\n80% of time the right decision to whatever dilemma you're having is to simplify.\n\nIf this helped you — let me know what resonated.\n\nOr tell me what you wish you knew before launching 🚀\n\nThank you for reading."
    },
    {
        "id": "1gzcx3s",
        "title": "I made a simple webpage builder",
        "score": 24,
        "url": "https://www.reddit.com/r/SideProject/comments/1gzcx3s/i_made_a_simple_webpage_builder/",
        "body": "I wanted to create a simple webpage builder like linktree or a link in a bio type site. I referenced existing open source alternatives to create my own. \n\nIt is currently free and I do intend monetize it but haven’t decided on prices and features. \n\nTechnologies used: NextJS, Vercel, AWS and MongoDB. \n\nCost: ~5 dollars and domain. There are only 2 users. \n\nhttps://inkle.me\n\n"
    },
    {
        "id": "1l2a1if",
        "title": "Made a placeholder image service sorted by category, free-to-use!",
        "score": 23,
        "url": "https://www.reddit.com/r/SideProject/comments/1l2a1if/made_a_placeholder_image_service_sorted_by/",
        "body": "Was looking for a more category-based alternative to picsum.photos and couldn’t find any - so I made my own!\n\nLove to hear some feedback and thoughts, check it out at https://static.photos"
    },
    {
        "id": "1kvu205",
        "title": "How you monetize your website.",
        "score": 24,
        "url": "https://www.reddit.com/r/SideProject/comments/1kvu205/how_you_monetize_your_website/",
        "body": "Hi everyone,\n\nI’ve been working on a few side projects mainly utility websites like image converters, JSON formatters, and similar tools, each having 2–3 pages. I’m now considering integrating Google AdSense to monetize these sites. However, their policies seem quite strict and complicated.\n\nRequirements like having 5–6 pages or a blog, original content, a domain age of 6–8 months, and more make it seem difficult to get approved. There’s also the risk of getting your account suspended if you don’t meet all the criteria.\n\nGiven these limitations, how are you all handling this? Have you found any reliable alternatives to Google AdSense that work well for small utility-based websites?"
    },
    {
        "id": "1kqdyfz",
        "title": "I built a low-cost alternative to Skype for international calling ($0.01/min)",
        "score": 16,
        "url": "https://www.reddit.com/r/SideProject/comments/1kqdyfz/i_built_a_lowcost_alternative_to_skype_for/",
        "body": "I built CallSky, an app for making affordable international calls to landlines and cell phones worldwide. With Skype shutting down this month, I wanted to create a simple alternative focused specifically on low-cost global calling.\n\n**What it does:**\n\n* International calls starting at $0.01/minute\n* Simple pay-as-you-go credit system\n* Available on iOS (Android coming soon)\n* Calls to 180+ countries\n\n**Why I built it:** When Microsoft announced they were shutting down Skype, I realised many people and businesses would lose their go-to solution for affordable international calling. Teams doesn't fully replace this functionality, so I saw an opportunity to fill this gap.\n\n**Early traction:** I released CallSky about 9 days ago and have had around 22 sales so far, worth £99 after the 15% Apple cut. Things have slowed down a bit after the initial boost that the App Store typically gives to new apps, but I'm encouraged by the early interest.\n\nhttps://preview.redd.it/chxm2x1pzq1f1.png?width=3510&format=png&auto=webp&s=7cfdcd5a076ac385a794a3e64ac3138ebfc33b56\n\n**Business model question:** I'm unsure if businesses would be interested in using this. Would offering a business subscription (perhaps $X/month for 50 employees) be viable? I'm thinking about adding an admin portal where managers could add/remove employees from the plan.\n\nI'm also trying to figure out the best way to reach businesses that might need this solution. Is LinkedIn outreach to operations managers a good approach? Or do you see this as primarily a consumer app that wouldn't appeal to corporate users? Would love insights from anyone with B2B SaaS experience.\n\nAt this point I'm stuck with the marketing and distribution, ideas welcome.\n\nThank you,"
    },
    {
        "id": "1iie53e",
        "title": "How do you all manage the hosting and cost.",
        "score": 16,
        "url": "https://www.reddit.com/r/SideProject/comments/1iie53e/how_do_you_all_manage_the_hosting_and_cost/",
        "body": "Hi there, I want to ask that how do you manage all this. ? Can u host your app for free. ? Like currently I don't have any budget not much users...So I would like to host my api.. So what are the best ways to handle this..And can we avoid to pay for domains and getting it for free ? Have you done such thing ?  pls provide your input."
    },
    {
        "id": "1f9mv0e",
        "title": "I made a chrome extension to summarize Reddit reviews for free",
        "score": 14,
        "url": "https://www.reddit.com/r/SideProject/comments/1f9mv0e/i_made_a_chrome_extension_to_summarize_reddit/",
        "body": "Hey\n\nLast month I showcased [Reddit Scout](https://www.redditscout.com/) on [here](https://www.reddit.com/r/SideProject/comments/1eeek90/i_created_a_site_to_summarize_reddit_reviews_on/) and since then the site has been featured on a few places like [There's An AI For That](https://theresanaiforthat.com/ai/reddit-scout/) and more recently, Matt Wolfe's blog [FutureTools](https://futuretools.beehiiv.com/p/end-reddit-doomscrolling-good).\n\nToday I shipped a chrome extension so you don't even have to go to the site. On Amazon pages a widget appears on the right allowing you to read the summary/recommendations/alternatives to the product you're looking at.\n\nYou can also perform searches by clicking the extension or by using cmd+shift+s on mac and ctrl+shift+s on windows.\n\nI just launched it so there may be bugs, any feedback is greatly appreciated\n\nCheers!"
    },
    {
        "id": "1i5r14z",
        "title": "Introducing Colanode: an open-source, local-first Notion & Slack alternative you can self-host",
        "score": 13,
        "url": "https://www.reddit.com/r/SideProject/comments/1i5r14z/introducing_colanode_an_opensource_localfirst/",
        "body": "Hi Reddit,\n\nI've recently been working on **Colanode -** an open-source, local-first alternative to Notion and Slack that you can self-host. With Colanode, all your data is stored locally on your device, and eventually synchronized with a central server to share updates with your collaborators. This design lets you edit documents or send messages even when offline; once you reconnect, your changes will sync automatically.\n\n# What can you do with Colanode?\n\n* **Real-Time Chat:** Stay connected with instant messaging for teams and individuals.\n* **Rich Text Pages:** Create documents, wikis, and notes using an intuitive editor, similar to Notion.\n* **Customizable Databases:** Organize information with structured data, custom fields and dynamic views (table, kanban, calendar).\n* **File Management:** Store, share, and manage files effortlessly within secure workspaces.\n\nThere are many more exciting things that are in plan to be built, but the core part so far was getting the sync engine to work! For now, you can try the desktop app, which easily connects to any server. Colanode provides an early beta version of Cloud servers which you can use for free to test it.\n\nFor more details, check out the GitHub repository: [https://github.com/colanode/colanode](https://github.com/colanode/colanode)\n\n  \nAny comment, feedback or suggestion would be welcome.\n\nThank you!"
    },
    {
        "id": "1kfqu97",
        "title": "I wasted hours categorizing bank transactions, so I built a tool that to do it automatically",
        "score": 12,
        "url": "https://www.reddit.com/r/SideProject/comments/1kfqu97/i_wasted_hours_categorizing_bank_transactions_so/",
        "body": "tldr; I built [BankCSVCategorizer](https://bankcsvcategorizer.com), a tool that automatically categorizes your bank transactions for spreadsheet budgeting\n\nHey r/SideProject!\n\nManually categorizing transactions was my biggest budgeting time sink so I built a tool to do it for me. My workflow goes:\n\n1. Download the CSVs from my bank accounts\n2. Drop them into [bankcsvcategorizer.com](http://bankcsvcategorizer.com)\n3. Download the categorized CSV and import directly into my spreadsheet\n4. Enjoy the graphs!\n\n# Features\n\n* Supports major US banks (Chase, Citi, Wells Fargo, Capital One, Amex)\n* Completely free during beta\n* 100% private - no financial data stored on servers\n\nWhat's Next?\n\n* Add custom categories\n* Add support for more banks\n* Figure out pricing - I want to offer a low-cost alternative to apps like Copilot, RocketMoney, etc. for spreadsheet budgeters, but I'm trying to figure out a fair price that will sustain the project. Would love input or advice on this!\n\nIf you budget with spreadsheets or want to get into budgeting, I'd love to hear your thoughts and feedback. Thanks!\n\n"
    },
    {
        "id": "1f2g0j9",
        "title": "Built an alternative to Goodreads for independent authors",
        "score": 11,
        "url": "https://www.reddit.com/r/SideProject/comments/1f2g0j9/built_an_alternative_to_goodreads_for_independent/",
        "body": ""
    },
    {
        "id": "1kxnobt",
        "title": "People with Full Time Jobs, When do you work on your project?",
        "score": 12,
        "url": "https://www.reddit.com/r/SideProject/comments/1kxnobt/people_with_full_time_jobs_when_do_you_work_on/",
        "body": "I have been working on my app for a few months now while having a full time job. It’s been a headache to juggle the 2. I’m curious as to how others manage. Do you exclusively work on the project after or before work? How do you manage marketing and project related meetings during the day? Do you ever feel guilty working on your side-project when you could be doing your main job?\n\nI’ve been working on a real estate investment calculator and I spend a lot of time connecting with investors and agents so I have meets during the work day. I love my project and believe I can grow it to something amazing but I don’t want to perform poorly at my full time job. Wanted to hear about what others’ experience was like."
    },
    {
        "id": "1h392rq",
        "title": "I Built a Collection of Alternatives to Popular Software and Apps\n",
        "score": 10,
        "url": "https://www.reddit.com/r/SideProject/comments/1h392rq/i_built_a_collection_of_alternatives_to_popular/",
        "body": "Hi, Quentin here 👋\n\nI've created a list of \"Software as a Service\" applications:\n\n👉 [https://youmightnotneed.co](https://youmightnotneed.co)\n\nFeel free to submit your own or share some feedback.\n\n**Some backstory:**\n\nI was collecting some tools for quite some time now for my own use. Mostly to take some inspiration and do some competitor research for my other products.\n\n2 weeks ago, I though it would be fun to build this into a directory website for anyone to use and contribute to.\n\nAfter 2 weeks of building, YouMightNotNeed was born. It's a community driven list of alternatives to popular software and applications.\n\nWe have around 30 tools in the collection and the site collected **100 unique visitors** in 3 days.\n\nEnjoy and thank you for your support!"
    },
    {
        "id": "1iwjyeg",
        "title": "Do you buy domain for every landing page you create for idea validation?",
        "score": 11,
        "url": "https://www.reddit.com/r/SideProject/comments/1iwjyeg/do_you_buy_domain_for_every_landing_page_you/",
        "body": "This year I had validated 3 ideas (none of them worked), but also I have bought domains also for them, which now leaves me with 3 useless domains.\n\nHow do you manage domain when validating idea?"
    },
    {
        "id": "1ku6tsq",
        "title": "Alternative to readable.com",
        "score": 11,
        "url": "https://www.reddit.com/r/SideProject/comments/1ku6tsq/alternative_to_readablecom/",
        "body": "Built an app to analyze text complexity + text rewrite to make it more readable, similiar to [readable.com](http://readable.com)\n\n"
    },
    {
        "id": "1kwm8k8",
        "title": "I've created the Simplest, Most Privacy-Friendly Google Analytics Alternative... Fully GDPR Compliant.",
        "score": 10,
        "url": "https://www.reddit.com/r/SideProject/comments/1kwm8k8/ive_created_the_simplest_most_privacyfriendly/",
        "body": "**It’s time to move on from clunky, legacy analytics dashboards.**  \nWe’ve been staring at the same static charts for years... it’s time for a fresh take.\n\nI’d love for you to check out [Litlyx](https://litlyx.com), a privacy-first, dead-simple alternative to Google Analytics.\n\nYour feedback would mean the world to me.\n\nBest,  \n**Antonio**  \nFounder & CEO, Litlyx"
    },
    {
        "id": "1ldw845",
        "title": "I want to build the most beautiful, aesthetic, free and open-source platform for learning Japanese ever 🇯🇵",
        "score": 10,
        "url": "https://www.reddit.com/r/SideProject/comments/1ldw845/i_want_to_build_the_most_beautiful_aesthetic_free/",
        "body": "As a long time Japanese learner, I always wanted there to be a simple online trainer for learning kana, Kanji and vocabulary - like Anki, but for the web. Originally, I created the website for personal use simply as a better alternative to kana pro and realkana (both of which I used extensively for brushing up on my kana), adding a bunch of aesthetic themes and fonts just for the fun factor. But, after a couple of my friends liked it, I decided to bring it online and see if it's of any use to the larger language learning community.\n\n# Overview\n\n* No ads, no subscriptions, no account sign-ups - you can jump straight into action and start learning without wasting time on making an account!\n* Hyper customizable, with more than a dozen different themes, text fonts and color palettes - that way, you can customize KanaDojo and train in your own, personal playground tailored specifically to your taste and needs\n* Kanji characters and vocabulary words divided into small, pre-made sets - so that learning is easy, fun, linear and intuitive\n* Built-in Kanji and Vocabulary mini-dictionaries - so that you can look up readings and meanings right in the app without switching tabs\n* Mobile-friendly\n* Full keyboard-only navigation on desktop through the use of intuitive keyboard hotkeys\n* Live in-game stats and feedback\n\nWith a beautiful, minimalist design philosophy and a terrifying amount of different themes, fonts and other customizations, I seriously want to build THE most user-friendly, customizable, beautiful and fun platform for learning Japanese that there is, accessible to all and 100% free - with the community's help!\n\nP.S. Don't be scared by the extravagant colors and fonts shown in the pictures above - this is just for demonstration purposes and you can of course change it to whatever you want on the actual website! Also, Kana Dojo is currently in its early alpha stages, so I apologize in advance if it looks a bit unpolished and for any bugs!\n\nどうもありがとうございます! 🇯🇵🇯🇵🇯🇵"
    },
    {
        "id": "1iktxir",
        "title": "Just Launched the Beta of My New App: IdeaVault - A Beautiful Alternative to Apple Notes",
        "score": 10,
        "url": "https://www.reddit.com/r/SideProject/comments/1iktxir/just_launched_the_beta_of_my_new_app_ideavault_a/",
        "body": ""
    },
    {
        "id": "1eaknoe",
        "title": "Save days of dev time and TON of $$$ using this services",
        "score": 9,
        "url": "https://www.reddit.com/r/SideProject/comments/1eaknoe/save_days_of_dev_time_and_ton_of_using_this/",
        "body": "Hey, I'm Morgan. After my last post, [https://www.reddit.com/r/SideProject/comments/1e5tlnh](https://www.reddit.com/r/SideProject/comments/1e5tlnh), I thought about how I could help you speed up your projects. Except for using Chat GPT and Boilerplates, I want to list all the services that saved me a ton of time and $$$$. I hope it will be useful for you as well. I also attached my mindmap of all the services I use/used.\n\nhttps://preview.redd.it/7i8e867ieced1.jpg?width=4984&format=pjpg&auto=webp&s=2b00a6b8b3656c2bfb5aa0283804864744e4adfe\n\nThe mindmap [https://drive.google.com/file/d/13jPETZQTtKzn04P6\\_C-s988FYqQjpONT/view?usp=sharin](https://drive.google.com/file/d/13jPETZQTtKzn04P6_C-s988FYqQjpONT/view?usp=sharin)\n\n# No Code\n\nIf you think that your product could be build with NO CODE, you should start with NO CODE! A lot of products started with no code platforms and solutions and only after they got traction they started to rebuild their products.\n\n* **Zapier**: Automation tool that connects different apps and services to automate workflows.\n\n**Forms**\n\nNo-code form builders allow you to create and integrate forms into your web app easily, collecting data from users without needing to code.\n\n* **Tally.so**: Simple and powerful form builder for creating forms without coding.\n* **Typeform**: Interactive form builder that creates engaging forms and surveys.\n* **Google Forms**: Free tool for creating surveys and forms, integrated with Google Drive.\n\n**Blogs**\n\nNo-code blogging platforms enable you to create and manage blogs without needing to develop a custom solution, offering various templates and tools for content creation.\n\n* **Ghost**: Professional publishing platform for creating online blogs and publications.\n* **BlogStatic**: Simple blogging platform with easy setup and management.\n* **Superblog AI**: AI-powered blogging platform for automated content creation and management.\n* **Bliberoo**: Blogging platform that allows easy creation and management of blogs.\n* **WordPress**: Popular content management system (CMS) for creating blogs and websites.\n\n**Testimonials**\n\nTestimonial tools help you collect, manage, and display testimonials from your users, adding credibility and trust to your web app.\n\n* **testimonial.to**: Tool for collecting video and text testimonials from your customers.\n* **senja.io**: Platform for collecting and showcasing customer testimonials.\n\n**Landing Pages**\n\nNo-code landing page builders enable you to create effective landing pages to capture leads, promote products, or convey information without needing a developer.\n\n* **Carrd**: Simple and responsive one-page sites for anything.\n* **Wix**: Drag-and-drop website builder for creating professional websites.\n* **Tilda**: Platform for building websites, landing pages, and online stores.\n* **Webflow**: Professional website builder with design, CMS, and hosting capabilities.\n* **Framer**: Tool for creating interactive designs and prototypes.\n\n**Newsletter**\n\nNewsletter tools help you create, manage, and send newsletters to your subscribers, keeping them informed and engaged with your content.\n\n* **Substack**: Platform for creating and monetizing newsletters.\n* **beehive**: Newsletter platform designed for content creators and publishers.\n\n# Local Development\n\nLocal development tools are essential for building, testing, and debugging your web app in a local environment before deploying it to production.\n\n* **Ngrok**: Provides secure tunnels to localhost, making your local development server accessible over the internet.\n* **Docker**: Container platform that packages your application and its dependencies, ensuring consistency across different environments.\n* **Notion**: All-in-one workspace for notes, tasks, databases, and project management, which can help in organizing and planning your web app development.\n* **devutils.com**: A suite of developer tools for JSON formatting, regex testing, and more, useful for everyday development tasks.\n* **ChatGPT/Copilot**: AI-powered coding assistants that help you write and debug code faster by providing suggestions and insights.\n* **DB GUI**: Tools like DBeaver or HeidiSQL Graphical user interfaces for database management, making it easier to visualize and manage your database.\n* **Fav IDE**: Popular Integrated Development Environments like VSCode or IntelliJ IDEA Provide powerful code editing, debugging, and development tools.\n* **Git GUI**: Graphical user interfaces for Git like Sourcetree or GitKraken Make version control more accessible and easier to manage.\n\n# Hosting\n\nHosting services are essential for deploying your app and making it accessible to users. Believe me or not, you can handle thousands of users with $7/m on Render.\n\n* **Netlify**: Simplifies the process of deploying and managing static websites and serverless functions.\n* **Render**: A unified platform to build and run all your apps, websites, and backend services with free SSL, global CDN, and auto deploys.\n* **Vercel**: Optimized for frontend frameworks and static sites, provides a great developer experience with instant deployments.\n* **Heroku**: Platform-as-a-Service (PaaS) that enables developers to build, run, and operate applications entirely in the cloud.\n* **AWS**: Comprehensive and widely used cloud platform offering a broad set of global cloud-based products.\n* **Digital Ocean**: Provides scalable compute and storage resources for developers, helping to deploy and scale applications easily.\n\n# CI/CD\n\nContinuous Integration and Continuous Deployment (CI/CD) tools automate the process of testing, building, and deploying your code, ensuring a smooth and reliable deployment pipeline. You can start with something simple. I'm still using ruby mina script for my RoR BE and Vercel for FE.\n\n* **GitHub Actions**: Automates your workflow directly from GitHub, enabling you to build, test, and deploy your code right from your repository.\n* **GitLab CI/CD**: Integrated into GitLab, provides a comprehensive suite for continuous integration and deployment.\n* **Bitbucket Pipelines**: Integrated CI/CD service built into Bitbucket for automated building, testing, and deploying of your code.\n* **CircleCI**: Enables continuous integration and continuous delivery for your projects, automating the build, test, and deployment process.\n* **Travis CI**: A continuous integration service used to build and test software projects hosted on GitHub.\n* **buddy.works**: A CI/CD tool designed for developers, providing pipelines for continuous deployment and integration.\n\n# Version Control\n\nVersion control systems are crucial for tracking changes in your codebase, collaborating with other developers, and managing different versions of your project. It's make no sense to not use them.\n\n* **GitHub**: Widely used platform for version control and collaboration, allowing you to host and review code, manage projects, and build software.\n* **GitLab**: Provides a complete DevOps platform, allowing you to manage repositories, CI/CD pipelines, and much more.\n* **BitBucket**: A Git repository management solution designed for professional teams, providing source code collaboration and CI/CD services.\n\n# Transactional Emails\n\nTransactional email services are crucial for sending automated emails to users, such as password resets, order confirmations, and notifications.\n\n* **Amazon SES**: Scalable and cost-effective email service for sending transactional and marketing emails.\n* **Mailgun**: Powerful APIs for sending, receiving, and tracking emails.\n* **Resend**: Service for sending transactional emails with easy API integration.\n* **SendGrid**: Cloud-based service that provides email delivery, integration, and marketing campaigns.\n* **Loops**: Simplifies the process of sending transactional emails with automation and API support.\n* **Postmark**: Focuses on fast and reliable delivery of transactional emails.\n* **Mailjet**: Provides email marketing and transactional email services with real-time monitoring and analytics.\n\n# Monitoring\n\nMonitoring tools help track the performance and health of your application, enabling you to detect and respond to issues quickly.\n\n* **Sentry**: Application monitoring platform that helps you identify and fix errors and performance issues.\n* **Bugsnag**: Automated error monitoring for identifying, prioritizing, and fixing bugs.\n* **AppSignal**: Provides insights into errors, performance, and server metrics.\n* **Airbrake**: Error monitoring and bug tracking for real-time error reporting and diagnostics.\n* **Datadog APM**: Comprehensive monitoring and analytics for your applications.\n* **New Relic APM**: Provides detailed performance metrics and diagnostics for your applications.\n\n# Logging\n\nLogging tools collect and analyze log data from your applications, helping you understand and troubleshoot issues.\n\n* **New Relic**: Offers log management alongside application performance monitoring.\n* **Datadog**: Provides log management and analytics, integrating with infrastructure monitoring and APM.\n* **Prometheus**: Open-source monitoring and alerting toolkit, particularly useful for time-series data.\n\n# File Storage\n\nFile storage services are essential for managing and storing files, images, and other media for your web applications.\n\n* **AWS S3**: Scalable object storage service, ideal for storing and retrieving any amount of data.\n* **Cloudinary**: Media management and optimization platform for images and videos.\n* **Uppy**: Open-source file uploader for uploading files directly to storage services.\n* **Uploadcare**: Provides file handling, image processing, and CDN delivery services.\n\n# Database\n\nDatabase services are essential for storing and managing your application's data efficiently and securely.\n\n* **AWS RDS**: Managed relational database service that supports various database engines, such as MySQL, PostgreSQL, and SQL Server.\n* **Firebase**: Backend-as-a-Service (BaaS) that provides real-time database and other cloud services to support mobile and web app development.\n* **Supabase**: Open-source Firebase alternative that provides a Postgres database, authentication, and real-time subscriptions.\n\n# Cache\n\nCaching services help improve the performance and scalability of your web app by storing copies of frequently accessed data, reducing the load on your backend servers.\n\n* **AWS Cloudfront**: Content Delivery Network (CDN) that delivers your content with low latency and high transfer speeds.\n* **Cloudflare**: Provides CDN, DDoS mitigation, internet security, and distributed DNS services, helping to improve the performance and security of your web app.\n\n# Authorization\n\nAuthorization services manage user access and permissions, ensuring that only authorized users can access certain parts of your application.\n\n* **clerk.com**: Authentication and user management platform for modern web applications, providing features like social login, user profiles, and access control.\n* **Supabase**: Offers authentication services alongside its database and real-time capabilities, simplifying user management and security.\n* **Firebase**: Provides authentication services supporting multiple login methods, including email/password, social logins, and custom auth systems.\n\n# Design\n\nDesign tools and resources help in creating visually appealing and user-friendly interfaces for your web applications.\n\n* **Figma Community**: A place to find design resources and templates shared by the Figma community.\n* **Dribbble**: A platform for designers to showcase their work and find inspiration.\n\n# UI Components\n\nUI component libraries provide pre-built, customizable components that help in building consistent and visually appealing user interfaces.\n\n* **Tailwind UI**: A collection of professionally designed, fully responsive HTML components built with Tailwind CSS.\n* **Chakra UI**: A simple, modular, and accessible component library for React applications.\n* **shadcn UI**: A collection of high-quality UI components built with shadcn, a modern CSS-in-JS library.\n* **Envato Elements**: Subscription-based service offering a wide range of digital assets, including UI components and templates.\n\n# Icons\n\nIcon libraries provide a wide variety of icons that can be used in web applications to enhance visual appeal and user experience.\n\n* **React Icons**: Includes popular icons libraries like Font Awesome, Material Design, and more, for use in React applications.\n* **Anron Icons**: A collection of high-quality icons for modern web applications.\n* **heroicons**: Beautiful hand-crafted SVG icons, by the makers of Tailwind CSS.\n* **Lucid Icons:**\n\n# Content Writing\n\nContent writing tools help in generating and managing written content for your web applications, blog posts, marketing materials, and more.\n\n* **ChatGPT**: An AI-powered tool that helps in generating and refining content, providing assistance in writing tasks.\n* **Copy AI:**\n\n# Analytics\n\nAnalytics tools provide insights into the performance and user behavior of your web applications, helping you make data-driven decisions.\n\n* **usefathom**: A simple, privacy-focused analytics tool.\n* **Simple Analytics**: Privacy-friendly analytics for understanding user behavior without compromising privacy.\n* **Plausible**: Simple and privacy-friendly alternative to Google Analytics.\n\n# Help Center\n\nHelp Center tools provide users with support and information about your web app, improving the user experience and reducing the load on customer support.\n\n* **Helpkit**: Easy-to-use help center and knowledge base platform.\n* **Bliberoo**: Platform for creating a help center and providing support resources.\n* **Crisp**: Provides live chat, help center, and knowledge base functionality.\n\n# Knowledge Base/Docs\n\nKnowledge base and documentation tools help create comprehensive guides and FAQs, assisting users in resolving issues independently.\n\n* **Mintlify**: Documentation platform designed to create engaging and informative documentation.\n* **Gitbook**: Documentation platform for creating and managing online documentation and guides.\n* **Bliberoo**: Provides tools for building a knowledge base and documentation.\n* **Crisp**: Also offers knowledge base creation alongside its help center and live chat features.\n\n# Live Chat\n\nLive chat tools enable real-time communication with users, providing instant support and improving customer satisfaction.\n\n* **Crisp**: Live chat software with multi-channel support and knowledge base integration.\n* **helpcrunch**: Provides live chat, email marketing, and help desk functionality.\n\n# Customer Feedback\n\nCustomer feedback tools collect and manage feedback from users, helping you understand their needs and improve your web app.\n\n* **canny**: Collects and organizes user feedback to help prioritize product development.\n* **user voice**: Platform for gathering and analyzing customer feedback.\n* **Nolt**: Feedback board tool that helps collect and prioritize feedback from users.\n* **Featurebase**: Tool for managing customer feedback and feature requests.\n\n# Marketing Emails\n\nMarketing email tools help create, manage, and send marketing campaigns to engage and retain users.\n\n* **loops.so**: Platform for creating and automating email marketing campaigns.\n* **Postmark**: Reliable email delivery service for transactional and marketing emails.\n* **Emailoctopus**: Simple email marketing platform with affordable pricing.\n\n# Localization\n\nLocalization tools help translate and adapt your web app to different languages and regions, improving accessibility and user experience.\n\n* **lokalise**: Collaborative translation platform for localizing apps, websites, and games.\n* **crowdin**: Localization management platform that simplifies the translation process.\n\n# Payments\n\nPayment processing tools facilitate the handling of online transactions, subscriptions, and billing, providing a seamless experience for users.\n\n* **Paddle**: Handles all aspects of payments, including taxes, billing, and compliance.\n* **lemonsqueezy**: E-commerce platform designed for digital products and subscriptions.\n* **Stripe**: Widely used payment processing platform that supports various payment methods.\n\n# Project Management\n\nProject management tools help you plan, track, and manage your web app development process, ensuring that your project stays on schedule and within budget.\n\n* **ClickUp**: All-in-one project management tool designed to manage projects, track progress, and collaborate with team members.\n* **Trello**: Visual collaboration tool that organizes your projects into boards, making it easy to track tasks and deadlines.\n* **Notion**: Integrated workspace that combines notes, tasks, databases, and project management features.\n* **JIRA**: Project management tool designed for software development teams, offering agile project management and issue tracking.\n\n# Domains\n\nDomain registration services help you secure a unique domain name for your web app, which is essential for establishing your online presence.\n\n* **Namecheap**: Affordable domain registration service with a wide range of additional services like web hosting and SSL certificates.\n* **Cloudflare**: Domain registration service that also provides security and performance features like CDN and DDoS protection.\n* **GoDaddy**: Popular domain registrar offering a wide range of services including domain registration, web hosting, and email hosting.\n\n# Domain Inbox\n\nDomain inbox services allow you to set up email accounts using your custom domain, enhancing your professional image and communication.\n\n* **improvmx.com**: Free email forwarding service that allows you to use your custom domain with any email provider.\n* **proton.me**: Secure email service with end-to-end encryption and support for custom domains.\n* **Gmail G Suite**: Professional email service by Google that allows you to use Gmail with your custom domain, along with access to other Google Workspace tools."
    },
    {
        "id": "1frd1gc",
        "title": "Cabin - a community-first alternative to Reddit, arriving Spring 2025",
        "score": 10,
        "url": "https://www.reddit.com/r/SideProject/comments/1frd1gc/cabin_a_communityfirst_alternative_to_reddit/",
        "body": "Hi all,\n\nEarlier this month we launched a landing page for Cabin ([https://cabin.social](https://cabin.social)), a discussion platform for digital communities. Since then, we have garnered significant interest from communities. We’re incredibly excited to launch Cabin to iOS and Android in Spring 2025, with a web experience following shortly thereafter.\n\nFor those wondering, Cabin is designed to serve as an alternative to platforms like Reddit. I have been a Redditor for over a decade and have watched as its leadership slowly degraded the experience for everyone in an effort to increase revenue. I understand capitalism–companies need to make money–but we believe there are better ways to drive revenue; ways that are more friendly to the communities we serve.\n\nLet’s talk about some (not all) of the things we’re focusing on:\n\n**Disinformation**\n\nWe understand our role and responsibilities in preventing the spread of disinformation on Cabin. Our team is exploring various methods of identifying and adding clarity to content that is found to be misleading or verifiably false. This is especially important with regards to topics such as politics, health, and race.\n\nWe will likely utilize machine learning to identify disinformation, and inform users by attaching a small note to the post.\n\n**Monetization**\n\nSimilar platforms primarily utilize ads for driving revenue. We’re exploring some alternative pathways to monetization that aren’t as abrasive to our communities. The reality is that we have to make money–building and maintaining digital platforms isn’t cheap. But that doesn’t mean our users should suffer.\n\nSome approaches we’ve considered:\n\n* **Premium Account**: Upgrade your account for a small monthly fee to receive benefits that elevate your experience.\n* **Premium Community**: Purchase power-ups (communities would come with X number of power-ups for free) for your community or contribute a few bucks toward a power-up for a community you’re a member of; we think Discord does a reasonably good job of this.\n\nNote: We have not identified what a premium account or community looks means in terms of features, but will share that with followers as soon as we have information worth sharing.\n\n**Early access**\n\nAs mentioned above, we’re aiming to launch early access for our iOS and Android apps in Spring 2025. Early access will be closed to the public, but users will regularly receive invite codes to share with friends (or strangers).\n\nIt’s free to join the waitlist. We will never share your email address with anyone and we will never waste your time with needless emails.\n\n[https://cabin.social](https://cabin.social)\n\n**Questions or suggestions**\n\nPlease feel free to ask questions or provide feedback and suggestions.\n\nThank you!"
    },
    {
        "id": "1kdobya",
        "title": "I made a open-source alternative to Producthunt and people already love it.",
        "score": 10,
        "url": "https://www.reddit.com/r/SideProject/comments/1kdobya/i_made_a_opensource_alternative_to_producthunt/",
        "body": "I've built Open-Launch, a complete open-source alternative to Product Hunt.  \n  \nFirst launch was today, at 8:00 AM UTC.  \n29 users have already registered, and the free spots are all taken until Tuesday.  \n  \nThe queue grows fast and I get great feedback.\n\nGitHub: [https://github.com/Drdruide/Open-Launch](https://github.com/Drdruide/Open-Launch)\n\nWebsite: [https://open-launch.com](https://open-launch.com)\n\nLooking forward to your feedback and contributions!"
    },
    {
        "id": "1fl7s1a",
        "title": "I built a better alternative to Winston, Pino, and CloudWatch for logging in Node.js",
        "score": 9,
        "url": "https://www.reddit.com/r/SideProject/comments/1fl7s1a/i_built_a_better_alternative_to_winston_pino_and/",
        "body": "I developed a better alternative to Winston, Pino, and CloudWatch for logging in Node.js. Here's why it's better:\n\n1.) Winston and Pino only capture custom logs, not standard console logs, Additionally, they don’t provide a dashboard for viewing logs, which forces you to rely on third-party services like CloudWatch.\n\n2.) CloudWatch, while useful, comes with several downsides. It’s a paid service, while Errsole is open-source and free. CloudWatch also affects the performance of your Node.js application, and setting it up is more complex compared to Errsole, which only requires adding two lines of code to your project. Furthermore, setting up alerts for critical errors in CloudWatch is tedious, and you still don’t get error context with email notifications. Errsole, on the other hand, offers a built-in dashboard where you can view, search, and filter logs. It also sends alerts via Slack or email, including error context and a direct link to the log. Plus, it's so easy to set up that even a junior developer can manage it.\n\n>[Errsole](https://github.com/errsole/errsole.js) has more features than these and it's FOSS (Free OpenSource Software)"
    },
    {
        "id": "1ji7v1p",
        "title": "Built an alternative to MarkUp.io. Thinking of giving away a few Lifetime deals. Any downsides?",
        "score": 8,
        "url": "https://www.reddit.com/r/SideProject/comments/1ji7v1p/built_an_alternative_to_markupio_thinking_of/",
        "body": "Hey everyone, Nabil here - Building BugSmash. \n\nSo MarkUp .io recently let go of their free plan and I saw a good opportunity to write some articles to get a few eye balls.\n\nReviews have been positive so far. But I haven't run any ads or campaigns yet to acquire more users. It's purely SEO as of now. \n\nThinking of running a Lifetime Deal for 100 users for a revenue boost. (Won't be able to sustain longer due to storage costs). \n\nWhat should I know before doing this? Any downsides? \n"
    },
    {
        "id": "1ildtzd",
        "title": "I created a simple project management tool",
        "score": 8,
        "url": "https://www.reddit.com/r/SideProject/comments/1ildtzd/i_created_a_simple_project_management_tool/",
        "body": "Sprixl is a simple alternative to complicated tools like Jira. You and your teammates can utilize Sprixl in order to plan, manage, and ship your project."
    },
    {
        "id": "1ib3sg6",
        "title": "I built a Private & Offline alternative to ChatGPT on your mobile device",
        "score": 6,
        "url": "https://www.reddit.com/r/SideProject/comments/1ib3sg6/i_built_a_private_offline_alternative_to_chatgpt/",
        "body": ""
    },
    {
        "id": "1jm0a59",
        "title": "I needed it so I built it for everyone",
        "score": 7,
        "url": "https://www.reddit.com/r/SideProject/comments/1jm0a59/i_needed_it_so_i_built_it_for_everyone/",
        "body": "**Hello everyone,**\n\nDesign2Code was born out of a real frustration. Spending hours trying to recreate UI components from scratch without a clear starting point.\n\nAs a developer with 8 years of experience, I often found myself browsing websites, admiring beautifully designed components, and wondering how they were built. I wished there was an easy way to take inspiration from existing designs and bring them into my own projects without having to reverse-engineer everything manually.\n\nThat realization hit hardest when I needed a custom React carousel looking like the one on Netflix for a side project. The existing libraries didn’t fit my needs, and tweaking them didn't work. The only solution? Build my own tool to generate the exact component I envisioned. It worked so well that I realized others might have the same struggle. Designers and developers who want to **turn UI inspiration into production-ready code effortlessly.**\n\nThat’s how **Design2Code** came to life.\n\nUnlike website builders that generate entire websites with rigid, often unscalable structures, **Design2Code focuses on what truly matters for developers and designers building real products—clean, reusable components.** When scaling a SaaS application, pre-built website templates fall short. You still need structured, maintainable code that integrates seamlessly into your existing stack. That is why I decided to focus on components to **bridge the gap between design and development by providing production-ready UI components** that follow best practices, making it easier to scale projects without sacrificing quality or flexibility.\n\nThe **beta** is free and available at [https://design2codeapp.com/](https://design2codeapp.com/)\n\nHope it will be useful to you and help in your endeavor! **Don't hesitate to reach out for any feedbacks or features to add.**\n\n**Wish you the best :)**"
    },
    {
        "id": "1l1ywpb",
        "title": "I built an app in 90 days because I was tired of screwing up Valentine's + Birthday + Anniversary season",
        "score": 7,
        "url": "https://www.reddit.com/r/SideProject/comments/1l1ywpb/i_built_an_app_in_90_days_because_i_was_tired_of/",
        "body": "Hey r/SideProject — first time posting here after lurking for a while.\n\nSo I've got this perfect storm every year: my wife's birthday and Valentine's Day are 4 days apart, followed by our anniversary, then our son's birthday. It's like a gauntlet of occasions that I kept half-assing because of the anxiety and stress.\n\nI'd find myself at Harris Teeter (local grocery store in NC lol) at 10pm, staring at sad flowers, thinking \"I'm such a piece of shit for not planning something better.\" Not because I forgot the dates — I just sucked at planning something meaningful in advance. For years I kept complaing to my buddy \"I wish there was an app for this\" and he finally convinced me to build it myself.\n\nHere's the thing: I have ZERO formal coding background. I spent a decade working in the fitness industry before burning out, pivoted to tech marketing, then became a stay-at-home dad for the last 3 years. But I'm obsessed with learning new things deeply and creating rapidly.\n\nSo I taught myself SwiftUI and with the help of Cursor developed this iOS app from scratch in 90 days to solve my own problem (feeling like a forgetful POS).\n\nMy iOS app is called Concero and it doesn't just remind you about dates, it creates hyper-personalized gift ideas and a step-by-step plan to execute them.\n\nFeatures:  \n• AI-powered gift suggestions based on recipient's interests  \n• Smart timeline with reminders for when to order/book  \n• Step-by-step planning to eliminate last-minute panic  \n• Completely free to use right now (on a credit system for time being)\n\nTech Stack:  \n• iOS native with SwiftUI  \n• Firebase for auth, database & cloud functions  \n• OpenAI API integration  \n• Built primarily with Cursor as my AI CTO  \n• Xcode for development environment\n\nI'd love your brutal feedback to make this better - download it, try creating one plan, and tell me what sucks (or doesn't):\n\n[https://www.concero.app](https://www.concero.app)\n\nIf you're a fellow last-minute scrambler, I'd especially love to hear if it actually helps you. No sugar coating needed - the good, bad, and ugly will all make this thing better. Also, AMA =\\]\n\nMuch love ya'll,\n\nAnt\n\nP.S. The app suggested my friend would love a custom Mandalorian cooking apron + curated spice box which is something I never would of pieced together. His reaction was def pretty great: \"Yo thank you so much for my gifts! It's actually wild I was just saying that I wanted to buy an apron and how convenient it would be.\""
    },
    {
        "id": "1gipa7i",
        "title": "I'm making a free alternative to the YouTube mobile application without distracting features",
        "score": 6,
        "url": "https://www.reddit.com/r/SideProject/comments/1gipa7i/im_making_a_free_alternative_to_the_youtube/",
        "body": "You can [join the Silo alpha by clicking here!](https://silo.rida.dev/) You can also view the small video demo I made [over here](https://www.youtube.com/watch?v=JM5PlANMd1A&feature=youtu.be)!\n\nI went cold turkey for Instagram, TikTok, Facebook, Discord, etc., and have been for months. Yet the one application I seemingly have not been able to go a week without has been YouTube.\n\nI think there's a lot of high-value content over there, and that's what I use the application for. Yet that content serves as a funnel for other distracting content & features. Whether it be perusing the comments, diving into infinite scroll sessions with YouTube Shorts, or falling into clickbait-y thumbnails.\n\n[The Silo homepage.](https://preview.redd.it/z1lkaivedlyd1.png?width=1408&format=png&auto=webp&s=a55b753999c5240cda789cf39aa2d89d4b510324)\n\nI'm making a YouTube client boasting an extremely minimalist UI that displays a chronological feed of the content from the creators you subscribe to, and nothing else. No shorts. No comments. No discovery. No recommendations. \n\nI've been working on it for two days, and just last night it entered a truly usable state and I'm getting so excited to share it that I decided to make a landing page where others can sign up to join the alpha."
    },
    {
        "id": "1jun6wp",
        "title": "I'm building a Markup.io alternative — got any pain points or missing features? Let me know, happy to build them!",
        "score": 8,
        "url": "https://www.reddit.com/r/SideProject/comments/1jun6wp/im_building_a_markupio_alternative_got_any_pain/",
        "body": "I’m building a leaner alternative to [Markup.io](http://Markup.io) — faster, more collaborative, with fewer limitations. Curious what pain points you’ve had with tools like it, and what features you'd actually use. No idea is too small!\n\nSelf-hosting? Cheaper plans? Something totally different? I’d love to hear it."
    },
    {
        "id": "1focf1s",
        "title": "I build a simple Focus tracker macOS app (alternative to Rize)",
        "score": 7,
        "url": "https://www.reddit.com/r/SideProject/comments/1focf1s/i_build_a_simple_focus_tracker_macos_app/",
        "body": ""
    },
    {
        "id": "1jaq56j",
        "title": "My SideProject is Live (Free Banner Designer)",
        "score": 6,
        "url": "https://www.reddit.com/r/SideProject/comments/1jaq56j/my_sideproject_is_live_free_banner_designer/",
        "body": "Hola!  \nWell it's an exciting day. My side-project went live. They say that if you're not slightly embarrassed by your product when it launches, then you've waited too long.\n\nWith [Bannerita](https://bannerita.com) , I wanted to offer a no-nonsense, fast-as-F banner designer. A simpler alternative to Canva made for coaches, ecommerce store owners, your wife and airbnb hosts.\n\nYou can generate a decent banner set in less than a minute, and there's a few Easter Eggs here and there, buried in the UI.\n\nI'd be so grateful if you can take the app for a spin, break a few things and let me know what you think so I can improve in the right direction.\n\nCheers 🍹\n\nhttps://reddit.com/link/1jaq56j/video/zzyj5reiljoe1/player\n\n"
    },
    {
        "id": "1hnvtz9",
        "title": "I created an alternative to Product Hunt where you can download products, visit product websites, or play web games. I also added a feature that helps you promote your product by connecting with affiliates who can help spread the word.",
        "score": 5,
        "url": "https://www.reddit.com/r/SideProject/comments/1hnvtz9/i_created_an_alternative_to_product_hunt_where/",
        "body": ""
    },
    {
        "id": "1l4vbsu",
        "title": "Hit 875 Signups in 1 Month with my Product Hunt Alternative",
        "score": 6,
        "url": "https://www.reddit.com/r/SideProject/comments/1l4vbsu/hit_875_signups_in_1_month_with_my_product_hunt/",
        "body": "Our open-source alternative to Product Hunt, has reached 875 users in just one month. This project is led by my girlfriend and me and without any paid ads, special promotions, or spammy tactics, we’re seeing around 120–150 unique visitors per day. \n\nOur domain rating climbed from 0 to 32 in the same time span, purely through our badge system and submitting to directories.\n\nIf you’re curious, check it out: [https://open-launch.com](https://open-launch.com). \n\nCheers!"
    },
    {
        "id": "1fagc94",
        "title": "I created a free, online Adobe alternative for creating animation, design and logo. Feedback welcome!",
        "score": 6,
        "url": "https://www.reddit.com/r/SideProject/comments/1fagc94/i_created_a_free_online_adobe_alternative_for/",
        "body": "TBH, I’ve been working on this project for almost 5 years and hesitated to share it on Reddit until recently, when I finally felt ready. I hope it can help you with your project's logo design and animation.\n\nTrangram is a completely free alternative to Adobe for creating and animating designs, logos, and more, all within your browser. No installation or sign-up required. Try the [editor](https://www.trangram.com/editor), I designed a quick tour for you! ❤️\n\n  \nI originally made Trangram for myself to simplify motion graphics creation, but as I kept working on it, I realized it could help others too. So, I kept improving it as a fun side project. I’ve been using it to create my own animations, and you can check them out on Trangram’s [gallery page](https://www.trangram.com/explore).  \n  \nI’ve got plans to add more features in the future. But I’d love to hear your feedback! Thanks so much for your support! 🙌  \n\n\n✨ If you want a quick look at Trangram's key features, check them out [here](https://www.trangram.com/).\n\n🤗 If you'd like to learn about my journey developing Trangram, you can read it [here](https://www.trangram.com/about).  \n"
    },
    {
        "id": "1k2stb4",
        "title": "OpenSource Alternative To PeazeHub Is Live 🚀!!!",
        "score": 5,
        "url": "https://www.reddit.com/r/SideProject/comments/1k2stb4/opensource_alternative_to_peazehub_is_live/",
        "body": "🚀 **Just Launched:** [**StudyFly**](https://cycno.is-a.dev/studyfly) — a minimalist Pomodoro tool for deep focus & productivity.\n\n🧠 **What it does:**\n\n* ⏱️ Pomodoro timer (Start / Stop / Reset)\n* ✅ Simple to-do list with task tracking\n* 📊 30-day productivity chart (Chart.js)\n* 🎨 Customizable session time & background\n* 💾 Fully offline (stores data in browser)\n* 📱 Clean, dark interface — mobile-friendly\n* 🔐 No sign-up. No data collection. 100% private.\n\n🧪 Just open the site and start working.  \n💬 Would love feedback, ideas, or bug reports!\n\n👉 Try it here: [https://cycno.is-a.dev/studyfly](https://cycno.is-a.dev/studyfly)"
    },
    {
        "id": "1lb6f20",
        "title": "From crying over 12 video views to $65 MRR. My 5-month side project journey as a waiter.",
        "score": 6,
        "url": "https://www.reddit.com/r/SideProject/comments/1lb6f20/from_crying_over_12_video_views_to_65_mrr_my/",
        "body": "Six months ago, I spent an entire Saturday making a 60-second video about email marketing tips. Eight hours of work. Posted it everywhere.\n\n12 views.\n\nI sat in my car before my restaurant shift and just broke down. The math was completely broken - 8 hours for 12 people to see my work.\n\nThat night I couldn't sleep. I kept thinking \"there has to be a better way to create content.\"\n\nSo I started a side project: build an AI tool that creates videos automatically.\n\nProblem: I'm a waiter. I know nothing about coding.\n\nSolution: ChatGPT became my coding teacher.\n\nFor 5 months, while working restaurant shifts, I'd come home and ask ChatGPT:\n- \"How do I build a web app?\"\n- \"What's an API?\"  \n- \"Why is my code broken?\"\n- \"How do I process payments?\"\n\nChatGPT patiently walked me through everything. JavaScript, databases, Stripe integration, deployment. Line by line.\n\nYesterday I hit a milestone: $65 MRR from 6 paying customers.\n\nIt's not much, but these are real people paying real money for something I built in my spare time while serving tables.\n\nThe tool turns text ideas into complete videos in 3 minutes. What used to take me 8 hours now takes 3 minutes.\n\nKey lessons:\n- ChatGPT is an incredible teacher for beginners\n- Start with your own problem  \n- Small MRR feels amazing when it's real\n- Side projects can work even with crazy schedules\n\nCurrently working on getting to $100 MRR while still serving dinner shifts.\n\nAnyone else building side projects while working full-time? How do you manage the time?"
    },
    {
        "id": "1jtmvip",
        "title": "I built Durust – visualize your blood reports through clean, responsive charts (PWA)",
        "score": 5,
        "url": "https://www.reddit.com/r/SideProject/comments/1jtmvip/i_built_durust_visualize_your_blood_reports/",
        "body": "Hey everyone,\n\nI’ve been working on a project called **Durust** (means \"well\" or \"healthy\" in a few languages), born out of my own frustration with how blood test results are presented.\n\nAfter getting my annual blood work done, I realized how outdated the experience is:\n\n* Labs give you PDF scans or bulky booklets filled with numbers and zero context\n* No trends over time, even if you’ve tested with them before\n* Reference ranges are sometimes missing\n* Doctors glance through the report, prescribe something, and that’s it — no deeper conversations\n\nSo I built **Durust** — a Progressive Web App that lets you upload your blood reports (PDFs for now), and it extracts biomarkers and reference ranges. You get:\n\n* Clean, responsive charts of your vitals\n* Trends over time as you add more reports\n* Both lab-specific and global reference ranges for comparison\n* A mobile-friendly UI you can install like an app\n* The ability to use your data with a doctor for more in-depth conversations\n\nYour reports are processed on an edge function and discarded after data extraction.\n\nIt’s free and I’d love feedback from this community:\n\n👉 [https://durust.ai](https://durust.ai)\n\nHappy to answer questions or dive into the tech stack if anyone’s curious!\n\nFun fact, something similar was the top comment of a *\"I wish there was an app for that\"* post in this subreddit: https://www.reddit.com/r/SideProject/comments/1ilyycg/whats\\_your\\_i\\_wish\\_there\\_was\\_an\\_app\\_for\\_that. Made me drop everything else and ship it fast! u/MaskedDesigner, I hope you like it!\n\n[Durust](https://preview.redd.it/fak091plcfte1.png?width=960&format=png&auto=webp&s=efba63e61973377cf188dc695fab73c6c4826c7b)\n\n"
    },
    {
        "id": "1hrojsu",
        "title": "Zasper: A Modern and Efficient Alternative to JupyterLab, built in Go",
        "score": 5,
        "url": "https://www.reddit.com/r/SideProject/comments/1hrojsu/zasper_a_modern_and_efficient_alternative_to/",
        "body": "I have built **Zasper**, a modern and efficient Jupyterlab alternative in Go. [https://github.com/zasper-io/zasper](https://github.com/zasper-io/zasper)\n\nEvery Jupyter Notebook runs with a Jupyter kernel (e.g. IPython kernel, IJulia kernel). The JupyterLab Server is responsible for managing the Jupyter kernels and serves as a broker between Jupyter Notebook running in LabApp(frontend) and Jupyter Kernel. Zasper replaces Jupterlab by reimplementing most of the Jupyterlab internals to run a kernel and the communication layer, etc.\n\nInitial benchmarks : **Zasper uses one fourth of RAM and one fourth of CPU used by Jupterlab.** While Jupyterlab uses around 104.8 MB of RAM and 0.8 CPUs, Zasper uses 26.7 MB of RAM and 0.2 CPUs.\n\nBlog: [https://zasper.io/blog/zasper-intro.html](https://zasper.io/blog/zasper-intro.html)\n\nLet me know what you think about the project.\n\nhttps://preview.redd.it/ga165q4xajae1.png?width=3420&format=png&auto=webp&s=79db346870181e7ecb396321f60f6975209a6d7f"
    },
    {
        "id": "1lpzgr7",
        "title": "I wish there was rapid way to create portfolio, wait...",
        "score": 6,
        "url": "https://www.reddit.com/r/SideProject/comments/1lpzgr7/i_wish_there_was_rapid_way_to_create_portfolio/",
        "body": "Back in the days, I wished there was a tool that helps me to build a portfolio & CV and helps me stand out of the crowd of ugly PDFs.\n\nEveryone has the same CV templates and it's hard to stand out here.\n\nPortfolio? It's crucial if you are freelancing, but hey, it's hard to create it, takes a lot of time.\n\nPagey solves that. Easy, fast, with out-of-the-box features. Coming soon."
    },
    {
        "id": "1lo14fq",
        "title": "Built a directory of job boards filterable by career niche",
        "score": 5,
        "url": "https://www.reddit.com/r/SideProject/comments/1lo14fq/built_a_directory_of_job_boards_filterable_by/",
        "body": "I've worked for job search startups and decided to put this together during my own job search. \n\nFor [**Job Search Database**](https://www.jobsearchdb.com/) stage 1, I curated over 1000 active job boards and made them filterable by industry or job function. Niche job boards like these offer an alternative to LinkedIn and Indeed, and include jobs that aren't on those expensive platforms.\n\nOver the past year it has brought in about $1400 (mostly ads I sold myself, some affiliate) on 18K New Users (GA). Lots of up front work but mostly passive now.\n\n"
    },
    {
        "id": "1jvat8q",
        "title": "I made a fast open-source file explorer for windows",
        "score": 5,
        "url": "https://www.reddit.com/r/SideProject/comments/1jvat8q/i_made_a_fast_opensource_file_explorer_for_windows/",
        "body": "# Da-Deep-Search 🔎\n\n# Overview 🎯\n\nDa Deep Search allows you to locate even the deepest files in your PC. It's meant to be a better, faster alternative to Windows Search without giving you annoying web results. \n\n# Features 📑\n\n* ✅ Quick access\n* ✅ Deep file search\n* ✅ Fast file search\n\n# 💁 How to use:\n\n* **Open the app with windows:**\n\n1. Create a shortcut of Da Deep Search.exe\n2. Place the shortcut under `C:\\Users\\[your username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup`\n\n* **Use the app:**\n\n1. Press LCtrl + Space to open / close the window.\n2. Select the drives you want to scan, in the left corner.\n3. Type the name of the file you want to locate and press enter.\n4. Click on the file you want to execute.\n\n# 🛠️ Tech Stack\n\n* **C++ 20**\n* **SFML 2.6.0** library\n* Visual Studio 2022\n\n\n# Links\n* Download it here: https://github.com/Drimiteros/Da-Deep-Search/releases/tag/v.2.1_2\n* Find the code here: https://github.com/Drimiteros/Da-Deep-Search"
    },
    {
        "id": "1jpxn1m",
        "title": "I Built a Self-Hosted Cheaper Alternative to Mailchimp Using AWS SES",
        "score": 5,
        "url": "https://www.reddit.com/r/SideProject/comments/1jpxn1m/i_built_a_selfhosted_cheaper_alternative_to/",
        "body": "[Dashboard](https://preview.redd.it/1qbhodq75hse1.jpg?width=3352&format=pjpg&auto=webp&s=133ffe8efbd23f654cfe53ef3acbfc5d9c8f564d)\n\n  \nHey everyone,\n\nI got tired of expensive email marketing tools like Mailchimp and Brevo, so I built **EazyEmailer**—a self-hosted alternative that runs on AWS SES. 🚀\n\nSince AWS SES costs **$0.10 per 1,000 emails** (compared to Mailchimp’s \\~$200 for 100K emails), I wanted a way to **cut costs but still have campaign tracking, automation, and an html editor.**\n\nLifetime free updates like AI email crafter, designer etc.\n\n# Key Features:\n\n✅ **Campaign Builder** – Set up email campaigns with ease.  \n✅ **HTML Template Builder** – Drag-and-drop editor, no coding needed.  \n✅ **Spam-Proof Delivery** – Uses AWS SES for better inbox placement.  \n✅ **Email Tracking** – Monitor opens, clicks, and conversions.  \n✅ **One-Click Deployment** – GitHub pipeline for easy setup.  \n✅ **Workflow Automation** – Send emails based on user behavior.  \n✅ **Limit Settings** – Control sending volume and avoid bans.\n\nIt’s fully **self-hosted**, so you have complete control over your emails and data—no monthly subscriptions or per-subscriber fees. 🎉\n\nWould love to hear your thoughts! If you're interested in trying it out or need help setting it up, let me know. 🚀\n\nHere’s the product link - [https://eazyemailer.com](https://eazyemailer.com)\n\nWhat do you guys think? Would you use something like this?"
    },
    {
        "id": "1hmax1r",
        "title": "I am a contributor to the Flutter project with a master’s degree in software engineering and many apps on the app store. How can I market my new development company to get my first clients.",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1hmax1r/i_am_a_contributor_to_the_flutter_project_with_a/",
        "body": "As the title suggests I am facing a hard time finding my first clients, I am willing to develop apps and design UI. \n\nA glimpse of my recently developed apps: \n\nTRPN’ a travel social media app with an integrated LLM: \n\nhttps://youtube.com/shorts/rmfj5Qh88Eo?si=F1AAYhB20xbfHoTz\n\nRYDN’/DRVN’ an alternative to Uber with a predictable pricing tool: \n\nhttps://apps.apple.com/us/app/rydn/id6475162563\n\nCipher Memores: a tool to store your sensitive photos encrypted and save them from spying apps (encrypted camera system + gallery + editing tool) \n\nhttps://apps.apple.com/us/app/cipher-memories/id6737484941\n\nCipher Chats a new approach to end to end encrypted messengers that is safer: \n\nhttps://apps.apple.com/us/app/cipher-chats/id6737703015"
    },
    {
        "id": "1f0qk4o",
        "title": "How Do You Manage All Your Side Projects?",
        "score": 5,
        "url": "https://www.reddit.com/r/SideProject/comments/1f0qk4o/how_do_you_manage_all_your_side_projects/",
        "body": "Hey fellow indie hackers and side project enthusiasts! 🚀\n\nI'm juggling a few side projects right now, and it's getting a bit chaotic trying to manage everything. I'm looking for some advice on how you all keep things organized.\n\nAre you using a CRM or any specific tools to centralize everything in one place? Specifically, I'm interested in how you're managing:\n\nPayments (like subscriptions, one-time purchases)\nLogin information for various accounts\nEmail lists and user communication\nGeneral project management and task tracking\nWould love to hear about the setups that work best for you, or any recommendations on tools that can help streamline the process. Thanks in advance!"
    },
    {
        "id": "1hy13i7",
        "title": "Alternative to vercel analytics?",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1hy13i7/alternative_to_vercel_analytics/",
        "body": "just reached the limit, what do you to track users in your web app?"
    },
    {
        "id": "1g556hx",
        "title": "We just finished our app for sperm donation.",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1g556hx/we_just_finished_our_app_for_sperm_donation/",
        "body": "What started as a side project between two students has the potential to grow into something more. We’ve developed a website and app for unregulated sperm donation, offering an alternative to traditional sperm banks and government-regulated processes. It’s a fun and innovative approach, though we’re not expecting it to make anyone rich. Right now, our focus is on improving the service, and everything is completely free to use. We’re excited to see where this journey takes us!\n\nOh, and if you want to become a sperm donor, you can start today. : D  \nBesides this, feedback is really appreciated.\n\n[Apple](https://apps.apple.com/de/app/rattlestork/id6503442456) [Android](https://play.google.com/store/apps/details?id=org.rattlestork.twa) [Website](https://rattlestork.org/)"
    },
    {
        "id": "1l0jkv5",
        "title": "Open-Launch is 1 month old today 🎂",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1l0jkv5/openlaunch_is_1_month_old_today/",
        "body": "Open-Launch is one month old today!\n\nHere's the latest on my open-source alternative to ProductHunt:\n\n* 784 users \n* 531 projects launched \n* 6.1k unique visitors\n\nHere's the link: [https://open-launch.com/](https://open-launch.com/)"
    },
    {
        "id": "1g4ul0t",
        "title": "I built PeerSplit – A free, privacy-focused, P2P alternative to Splitwise (group expense-splitting app)",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1g4ul0t/i_built_peersplit_a_free_privacyfocused_p2p/",
        "body": "Hey everyone! 👋\n\nI'm Tanay, and I just wrapped up a side project that I've been working on—PeerSplit (https://peersplit.app). It's a free, privacy-first alternative to Splitwise for splitting group expenses. No signups, no ads, no subscriptions. Just straight-up, peer-to-peer expense tracking. 😎\n\n* **Free, no signup required** – No personal data needed, no hidden costs.\n* **P2P syncing** – Your data is shared directly between devices—no servers storing anything.\n* **Local-first** – Fully offline-capable.\n* **Cross-platform** – Runs smoothly on mobile, desktop, or wherever you prefer.\n* Minimal UX that just works, plus **dark mode**.\n\n# Tech stack:\n\n* Built with Nuxt + Nuxt UI.\n* Progressive Web App (PWA), so you can install it on your device.\n\nI’d love for you to check it out, and I’m super open to feedback or feature ideas. Feel free to leave a comment, or hit me up on Twitter/X or GitHub!\n\nhttps://preview.redd.it/855a5rupx2vd1.png?width=1080&format=png&auto=webp&s=2878e3f288e71816ceff3ad9049e1957bd0d5235\n\n"
    },
    {
        "id": "1k3tcsa",
        "title": "I built Image Router - A Unified Interface for AI Image Models (Like OpenRouter, but for Images)",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1k3tcsa/i_built_image_router_a_unified_interface_for_ai/",
        "body": "Hi,\n\nI use OpenRouter a lot for testing different text AI models and really like having that single interface for all LLMs. I wished there was something similar for AI image generators out there, so I decided to build it myself.\n\n**What is it?**\n\nImage Router is one website and API where you can access many different AI image generation models (I've added 27 so far). You just need one account to try them out. Three of the models are currently free. It also has a unified API, so you can switch between models in your own code without any changes.\n\n**Privacy Focused:**\n\nImage Router does not store any images you generate. This means you need to download anything you want to keep! Some images might only be available for an hour or so in the tool, while others are stored in your browser.\n\n**Beta Testers Welcome:**\n\nIt's still in beta, so there might be some bugs. I'm here to help if you run into issues.\n\nLet me know what you think!\n\nYou can try it here: [https://ir.myqa.cc/](https://ir.myqa.cc/?mtm_campaign=r-SideProject)\n\nSource code: [https://github.com/DaWe35/image-router](https://github.com/DaWe35/image-router)\n\nhttps://preview.redd.it/4mjw99z5b1we1.png?width=2452&format=png&auto=webp&s=e30b35391b8e9fd167425c594f00f791e025ab88\n\nhttps://preview.redd.it/n7s3az72b1we1.png?width=2804&format=png&auto=webp&s=b33b4e49ed8eb7142d8eb366b6b6c760c14640ae\n\nhttps://preview.redd.it/micc3w72b1we1.png?width=2849&format=png&auto=webp&s=efd895ca085037a27bcc4e22bff7d6251a606987"
    },
    {
        "id": "1ljdvf4",
        "title": "Share your vibe coding story",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1ljdvf4/share_your_vibe_coding_story/",
        "body": "Hey makers, I’m joining the wave of vibe coding and I’d love to learn from your journey.\n\nIf you’re a non-technical or semi-technical solo builder working on an AI-based product, I’d love to hear:\n- How do you go from idea → AI prompt → usable app?\n- What tools are you using? (e.g. ChatGPT, Claude, Lovable.dev, Bubble, Airtable, etc.)\n- How do you manage prompt iteration, product logic, and output testing?\n- What’s been the hardest part (e.g. UI, reliability, prompt hallucinations)?\n- Any tips or rituals you swear by when building alone?\n\nDrop your thoughts, tools, wins, fails — so we can learn from each other. "
    },
    {
        "id": "1jm0tmr",
        "title": "my app had a good launch, but now what?",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1jm0tmr/my_app_had_a_good_launch_but_now_what/",
        "body": "i launched [Recurroo](https://apps.apple.com/us/app/recurroo-track-subscriptions/id6743495252) not too long ago.\n\nI built this app because I was drowning in subscriptions - App Store subs, streaming, gym, bills, you name it. I’d forget renewals, miss cancellations, and had no idea how much I was really spending. I needed a better way to stay on top of it all, so I created Recurroo to bring some order to the chaos.\n\nWith [Recurroo](https://apps.apple.com/us/app/recurroo-track-subscriptions/id6743495252), you can track all your subscriptions in one place with a beautiful calendar view, swipe left/right to review what you’re actually using (it’s weirdly fun!), and see smart stats to save money. It’s got widgets for quick checks, tons of pre-made icons, and multi-currency support for global users.\n\nThe initial launch went well. Good reviews, good feedback... And a few trial sign ups too. And, it might not seem like a lot, but everyone that took up the trial converted to a paying user.\n\nBut now that the dust has settled, we hardly get 1-2 downloads a day. the ASO game sucks. What do I do?\n\nI need help for two things:\n\n1. Anyone here with experience to help with ASO?\n\n2. Anyone here with experience with TikTok?\n\nI really don't mind getting into some sort of rev-share agreement. If interested, hit me up?"
    },
    {
        "id": "1g97hxx",
        "title": "I made a web alternative to Screen Studio (with a free plan): showkit.app - Looking for early users and feedback.",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1g97hxx/i_made_a_web_alternative_to_screen_studio_with_a/",
        "body": ""
    },
    {
        "id": "1euh436",
        "title": "Alternatives to Stripe for Receiving International Payments in India?",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1euh436/alternatives_to_stripe_for_receiving/",
        "body": "Looking for a reliable alternative to Stripe for receiving international payments in India. Any recommendations?"
    },
    {
        "id": "1l5o8sz",
        "title": "How do you manage multiple LLM API keys without going insane?",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1l5o8sz/how_do_you_manage_multiple_llm_api_keys_without/",
        "body": "Hi everyone,  \n  \nI am currently juggling OpenAI, Claude, Gemini, and Grok in different projects. Sometimes testing things out locally with ollama, barely running around with 5$ credit in each of these closed source LLMs.   \n  \nMy major problem has been switching the different Authentication methods, response formats, rate limiting. Some LLMs adjust to the prompt like \"dont include any words, always return a JSON\", but need additionally parsing to strip out characters, but some LLMs dont respect the prompt at all which is frustrating when the app is in production and you need to switch to a different LLM temporarily.\n\nSo my question is  \n  \n1. How do you switch between these LLMs without maintaining 5 different API keys? There's got to be a cleaner approach?  \n2. How are you handling multi-provider LLM integration? Any tools/patterns that make this less painful?\""
    },
    {
        "id": "1g5bxgn",
        "title": "I created an alternative to LinkTree",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1g5bxgn/i_created_an_alternative_to_linktree/",
        "body": "We call this platform Raíz, place where you can centralize all your social media, images, and projects in one place and share your link with the world. Here are the features we offer:\n\n* Easily share all your social platforms in a single link.\n* Upload images and showcase your work attractively.\n* Customize your space to reflect your unique style.\n* Access analytics to see who visits your profile and what interests them.\n* Communicate directly with your followers to build meaningful connections.\n\nUsing LinkTree, I felt that many of their premium features and customizations are not that difficult to replicate. It seems to overcomplicate what should be a simple option of just adding links. That’s why I created Raíz—to bring simplicity back to what should be straightforward.\n\nWhat do you think? What improvements would you suggest? You can try the demo. Everything is set up using your Google or GitHub account, and Supabase stores that information. I only use your email for internal configurations\n\nDemo -> [https://raiz.ecostudios.dev/](https://raiz.ecostudios.dev/)\n\nhttps://reddit.com/link/1g5bxgn/video/a2k7wg9j27vd1/player\n\n"
    },
    {
        "id": "1kvsazc",
        "title": "As a full time worker, how do you manage your side projects?",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1kvsazc/as_a_full_time_worker_how_do_you_manage_your_side/",
        "body": "Balancing a full-time job while trying to build something on the side has been more challenging than I expected. I’m not a developer, so I’ve been leaning on no-code tools to get my project off the ground. They've been great for mapping out ideas and building early versions, but I’m starting to feel their limitations, especially as the project gets more complex.\n\nI’ve been thinking about bringing in someone with more technical experience to help push it further, but I’m still trying to figure out if it’s the right time or if I should keep hacking away a bit more on my own. Also how do I manage them if I do hire, especially since I'm barely around. \n\nIs this something you've done? I'm curious to how others in similar spots has handled this, especially if you’re not technical? Has hiring help early made a big difference for anyone?"
    },
    {
        "id": "1hbk4qk",
        "title": "A better alternative to AnswerThePublic to find valuable problems to solve?",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1hbk4qk/a_better_alternative_to_answerthepublic_to_find/",
        "body": "Hey folks,\n\nI've built a simple tool called Reddit Question Search that helps you find frequently asked questions in subreddits. \n\nWe've all used tools like AnswerThePublic to find popular questions on a topic. The problem? They lack context and real pain points, leaving us guessing about user intent.\n\nReddit, on the other hand, is a goldmine of context and nuance. My tool makes it easy to tap into those threads.\n\nHere's how it works:\n\n1. It searches for question patterns like \"what\", \"how\", \"can\" etc. in your chosen subreddit.\n2. It generates a Google search query to find relevant threads.\n\nFor example, if you're exploring r/ProductManagement, you can see the most frequently asked \"What\" and \"How\" questions. If an interesting keyword pops up, like \"strategic thinking\", you can use the tool to find all related threads on that topic.\n\nInstead of building products people say \"looks interesting, but I wouldn't pay for it,\" use this to find the burning problems folks are actively struggling with right now.\n\nGive the tool a try here: https://shavinpeiries.com/reddit-search/\n\n[I've also written a detailed how-to-guide on finding valuable problems to solve using Reddit.](https://shavinpeiries.com/how-to-find-shut-up-and-take-my-money-problems-using-reddit/)\n\nLet me know what you think!"
    },
    {
        "id": "1fh0ofm",
        "title": "Issus with Paypal (could you recommend alternative)\n",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1fh0ofm/issus_with_paypal_could_you_recommend_alternative/",
        "body": "Hi, I’m currently building a subscription service using PayPal’s API with tiers like Free, Basic, and Pro. I’ve managed to implement upgrading from Basic to Pro (though the documentation was really frustrating). However, because of how PayPal works, when a user upgrades their subscription, the actual payment for Pro isn’t processed until the current subscription period ends. Despite this, I’m experiencing that the subscription gets upgraded to Pro even if the Pro payment hasn’t been completed yet.\n\n\n\nIs there someone who can help me understand if I’m missing something? Alternatively, I’ve heard about alternatives to PayPal like Paddle and Lemonsqueezy. Which service would be better to use for subscription? I can’t use Stripe in my country."
    },
    {
        "id": "1g4iwh3",
        "title": "[Showoff] Artavolo.com - A Simpler, Flexible Alternative to Trello & Airtable 🚀",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1g4iwh3/showoff_artavolocom_a_simpler_flexible/",
        "body": "Hey r/sideproject! 👋\n\nI’ve been working on a project that I’m excited to share with you all: [**Artavolo.com**](https://www.artavolo.com).\n\nIt’s a **project management tool** that’s kind of a mashup of **Trello** and **Airtable** — but with a simpler, more customizable approach. After using tons of tools that didn’t quite fit, I decided to build something that does both boards *and* tables but stays lightweight and easy to use.\n\n# 🌟 Key Features:\n\n* **Kanban + Table Views**: Switch between board (Trello-style) and table (Airtable-style) layouts.\n* **Calendar View**: Manage tasks by due date and get a bird's-eye view of deadlines and timelines.\n* **Card View**: Display and organize items in a card format for quick overviews.\n* **Custom Fields**: Tailor the columns to fit exactly what your project needs.\n* **Drag & Drop Simplicity**: Move tasks around easily.\n* **Team Collaboration**: Real-time updates when working with your team.\n* **Free Plan**: You can try it out without committing to anything.\n\n# Why I Built It:\n\nI wanted something easy like Trello, but with more flexibility (without the Airtable learning curve). Artavolo is my take on the balance between simplicity and power.\n\n# 👉 Check it out: [www.artavolo.com](https://www.artavolo.com)\n\nI’d love to hear what you think or if you have any feedback! Any thoughts are super helpful.\n\nThanks for taking a look! 🙌"
    },
    {
        "id": "1h3ja49",
        "title": "[SaaS/Micro Saas development] Many people, little traffic",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1h3ja49/saasmicro_saas_development_many_people_little/",
        "body": "For a few months now, I've been developing small applications. I thought it would be technically complicated, but I realized that the hardest part was getting visibility. The Internet is full of curious people browsing pages/topics/trends. Yet I have the impression that it's not easy to generate traffic for your application without a solid marketing background. \n\nHow do you manage?"
    },
    {
        "id": "1kv9hcw",
        "title": "Remember the charm of pixel art games? 🕹️ I've brought that vibe to a weather app, and it's got an ML brain! 🧠🌦️",
        "score": 2,
        "url": "https://www.reddit.com/r/SideProject/comments/1kv9hcw/remember_the_charm_of_pixel_art_games_ive_brought/",
        "body": "Hey everyone! For my final university project, I decided to build something a bit different: **Pixel Weather**, an Android app that delivers your daily forecast with a unique, custom-designed pixel art UI.\n\nIt's not just a pretty face though! I've integrated a TensorFlow Lite model that runs locally to predict the **\"Feels Like\"** temperature, offering a smart alternative to standard API data.\n\n**What you'll find:**\n- ✅ Current, hourly & daily forecasts\n- 🤖 ML-powered \"Feels Like\" temp\n- 📍 Geolocation & manual city search (with saved locations!)\n- 🎨 Customizable themes & units (C/F)\n- 🔄 Pull-to-refresh & page indicators\n\nBuilt with Kotlin, Jetpack Compose, Hilt, Room, Retrofit, and TFLite. It's open-source (ad-free)!\n\n**🔗 Dive into the code & see more screenshots on GitHub:** https://github.com/ArtemZarubin/PixelArtWeatherML\n\n**🚀 Grab the APK from the latest release:** https://github.com/ArtemZarubin/PixelArtWeatherML/releases\n\nWould love to hear what you think, especially about the pixel art style in Compose and the ML integration! Feedback is super welcome."
    },
    {
        "id": "1hnnsls",
        "title": "I turned my Apple Notes todo process into an open-source desktop app - Simpletodo",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1hnnsls/i_turned_my_apple_notes_todo_process_into_an/",
        "body": "Hi everyone!\n\nI’m excited to share **Simpletodo**, an open-source app that mirrors how I’ve managed my tasks for years. It’s designed to make task organization feel natural—like taking notes—while being tailored for todo management.\n\nBefore this, I used Apple Notes to manage my tasks because it was simple and worked well for me. Over time, I developed a method that made staying organized easy, and I turned that system into a dedicated app for others to try. You can learn more about why I created it here: [simpletodo.app/why](http://simpletodo.app/why).\n\nIf it sounds like something you’d find helpful, feel free to check it out: [simpletodo.app](http://simpletodo.app/)\n\nI’d love your feedback—what do you think about the app? How do you manage your tasks? I’m open to all thoughts and suggestions! 😊\n\n[app view](https://preview.redd.it/r7s24qqr2g9e1.png?width=2985&format=png&auto=webp&s=1689caa3215a901c1f6deb4317e9aacb46957e0b)\n\n[carryover tasks](https://preview.redd.it/0e7g3pqr2g9e1.png?width=2985&format=png&auto=webp&s=e591a4b24b0303ca0c65bf98e9f9574b200c6844)\n\n  \n"
    },
    {
        "id": "1gudh2y",
        "title": "I built my own Frontend CMS from the ground up :) - sling.biz, an open source alternative to Builder.io",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1gudh2y/i_built_my_own_frontend_cms_from_the_ground_up/",
        "body": "https://preview.redd.it/7a32w7r1rp1e1.png?width=3456&format=png&auto=webp&s=0d63c5eca9f3d4dfb0915ba7926f2cf420c9f9b5\n\nhttps://preview.redd.it/1tt77bt1rp1e1.png?width=965&format=png&auto=webp&s=74cd7d6201fd482c046891d620106f1685da182f\n\n"
    },
    {
        "id": "1ji1fli",
        "title": "PRODUCT HUNT ISN’T THE HOLY GRAIL",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1ji1fli/product_hunt_isnt_the_holy_grail/",
        "body": "Hi all! After few weeks of building I’m here to share with you our last discovery from our TypewrAIter experiment: We recently got listed on There’s An AI For That (TAAFT) without even submitting our tool. Someone just… found it useful. That’s it. No launch. No upvote begging. No optimized comment thread strategy. Just organic discovery.\nSo?\nToday, 18% of our traffic is coming from There’s An AI For That (TAAFT).\nCompare that to Product Hunt—just 2%, despite all the hype. All the tips. All the guides.\n\nwhat that tells us?\n\t1.\tPeople are actively exploring alternatives to the mainstream launch: Communities and tools like TAAFT are becoming real discovery engines—because they’re built for users searching for actual solutions, not launch hype.\n\t2.\tYou don’t need to yell into the void. Sometimes it’s better to quietly build something useful and let your users do the talking (or listing) for you. That kind of validation is gold.\n\t3.\tLaser-targeted discovery beats general hype. People who find you via niche communities or different ways are more likely to actually use your product—not just give you a temporary spike in visits and dopamine.\n\nWe’re still early in our TypewrAIter journey, but this little spike in traffic from TAAFT vs. the negligible result from Product Hunt has completely reframed how we’re thinking about distribution. \n\nAnyway, shoutout to whoever listed us on TAAFT—thank you. You’ve given us way more than a few clicks. You’ve helped us rethink how we approach real growth.\n\nHappy to answer questions about what we did / didn’t do to get noticed. It’s been a ride."
    },
    {
        "id": "1fhioft",
        "title": "Problems with starting a side hustle or business idea",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1fhioft/problems_with_starting_a_side_hustle_or_business/",
        "body": "Those who have an earning side hustle: how did you set it up and how do you manage it with an employer?\n\nMy problem is that incorporation, bank account setup and all that seem like an overkill if you aren’t even sure if the thing will fly and scale. I would probably do that after having first 10 paying customers. What are the work around?"
    },
    {
        "id": "1joukmx",
        "title": "I built a brain-training app to help people use their phones more mindfully – would love your feedback!",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1joukmx/i_built_a_braintraining_app_to_help_people_use/",
        "body": "Hi everyone!  \nI recently launched **NeuroNudge**, an iOS brain-training app designed to give people a healthier, more productive alternative to mindless scrolling.\n\nInstead of endless feeds, the app offers fun, short games that help train memory, reaction time, focus, and problem-solving. The goal? Give your brain a little boost — anytime, anywhere — and build healthy daily habits along the way.\n\n# 🧩 What’s in the app\n\n* Reaction Time tests\n* Memory games (like card pairs, pattern recall)\n* Math challenges, 24 Game, riddles, pattern recognition\n* Daily challenges & progress tracking\n* Clean, minimal design – dark/light mode\n\nThe app is **live now on the App Store**:  \n[https://apps.apple.com/no/app/neuronudge/id6743054000?l=nb](https://apps.apple.com/no/app/neuronudge/id6743054000?l=nb)\n\n# Why I built it:\n\nI wanted to create something that feels *good* to use — the opposite of endless scrolling and digital noise. I’m hoping it can help people build sharper minds and healthier tech habits, even just 5 minutes a day.\n\nThis is still the early stage, and I’d **genuinely love your thoughts** — feedback, bug reports, feature ideas, anything.\n\nhttps://preview.redd.it/4s0pjvumx7se1.png?width=1206&format=png&auto=webp&s=66ef5eb5338372c3dcd20d5462e52db631c3b0d0\n\nhttps://preview.redd.it/03u13rbkx7se1.png?width=1320&format=png&auto=webp&s=97e0f9c78fb22655c1e66d74cdf8d0d66dd45a69\n\nhttps://preview.redd.it/db6dirbkx7se1.png?width=1320&format=png&auto=webp&s=1f236f24cbba8fd5bd1b201542f7cf1267117f73\n\nThanks for checking it out — and shoutout to everyone in this subreddit who’s building cool things. You're inspiring. 🙌"
    },
    {
        "id": "1hs99aj",
        "title": "The ROI of AI Tools... Do you really need them all?",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1hs99aj/the_roi_of_ai_tools_do_you_really_need_them_all/",
        "body": "I've recently taken a hard look at the tools I use for development and decided it's time to cut back. I canceled my subscriptions to bolt and lovable because I just wasn't using them enough to justify the cost.\n\nInstead of juggling a bunch of tools, I'm focusing on a select few that really get the job done. Here's my current stack for building my SaaS projects and handling client work:\n\n**Planning & Research:**\n\n* **ChatGPT**: Great for brainstorming and generating ideas.\n* **Perplexity**: Helps answer specific questions with factual information.\n\n**App Development:**\n\n* **Full Stack Roadmap**: My own product that provides AI-generated context documents and UI designs for IDEs like Cursor and VSCode.\n* **Cursor**: An AI-powered code editor that enhances coding efficiency.\n* **Codeium**: Offers AI-driven code completion and suggestions across multiple IDEs.\n\n**Automation & Hosting:**\n\n* **Make**: Automates workflows by connecting various apps and services.\n* **Vercel**: Hosts frontend applications with seamless deployment.\n* **Netlify**: Another option for frontend hosting, offering a composable web architecture.\n* **Render**: Handles backend hosting needs efficiently.\n\n**AI APIs:**\n\n* **Replicate**: Runs and deploys open-source AI models via API.\n* **Fal**: A generative media platform for developers, offering fast inference for AI models.\n* **Anthropic**: Provides advanced AI models for various applications.\n* **OpenAI**: Offers a suite of AI tools and models for diverse use cases.\n\n**Backend Services:**\n\n* **Firebase**: Manages authentication, database, storage, and analytics, leveraging Google Cloud's infrastructure.\n* **Supabase**: An open-source alternative to Firebase, suitable for smaller projects.\n\n**Email Services:**\n\n* **Resend**: Exploring this service for email functionalities.\n* **SendGrid**: Considering as an alternative for email services.\n\nBy narrowing down my toolkit, I'm aiming to boost productivity and cut unnecessary costs. It's all about getting the most value from the tools I choose to use.\n\nI've also realized that spending money on multiple chatbots isn't yielding a good return on investment. The novelty of AI has worn off, and it's time to focus on what's truly necessary for my work.\n\nTools aren't just toys; they're essential parts of the business. It's time to get serious about what I really need to succeed."
    },
    {
        "id": "1kjurvt",
        "title": "What do you use for mobile app billing, native SDKs or third-party gateways?",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1kjurvt/what_do_you_use_for_mobile_app_billing_native/",
        "body": "I am going to integrate subscription in my app. So, trying to find what others are using for handling in-app purchases or subscriptions. Do you stick with the native billing SDKs like Google Play Billing or Apple’s StoreKit or opt for third-party payment gateways like Stripe, Paddle, etc ?"
    },
    {
        "id": "1ee7dpf",
        "title": "How do you manage all your subscriptions?",
        "score": 5,
        "url": "https://www.reddit.com/r/SideProject/comments/1ee7dpf/how_do_you_manage_all_your_subscriptions/",
        "body": "i and my team are building a dashboard for all your subscriptions. so you’ll never pay excess when you want it not. you’ll also have an overview of how many & how much each subscriptions is benefiting you\n\nso could you list down all the sites you’re subscribed to?"
    },
    {
        "id": "1l44ugm",
        "title": "If your form is bad, this app doesn't count it (Cough~ pump push ups)",
        "score": 4,
        "url": "https://www.reddit.com/r/SideProject/comments/1l44ugm/if_your_form_is_bad_this_app_doesnt_count_it/",
        "body": "The goal is to provide a more affordable and accessible alternative to ensure proper form for those at home or on the go. If your movements don’t match the video, the app will give you real-time verbal feedback to help you improve your form. \n\nFeel like a lot of us **watch** instructional videos but don’t actually do the exercises correctly, which leads to slower progress. I was definitely guilty of this when I started out. \n\nWe were thinking of placing a minimum for the form strictness, but we wanted to accommodate more people with limited mobility. So, rather than just giving you a workout plan, it'll make sure that you do it properly (given how strict you want it). Hopefully, this tool helps others stay more accountable with their stretching or workouts at home. Lmk what you think!\n\nCheck out the screenshots on the [App Store](https://apps.apple.com/us/app/firefly-form-trainer/id6464440707)."
    },
    {
        "id": "1g71vbx",
        "title": "Introducing ScreenPost: Your New Screenshot Mockup Generator! ",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1g71vbx/introducing_screenpost_your_new_screenshot_mockup/",
        "body": "\nHey Reddit community! 👋\n\nI’m excited to share a project I built called **ScreenPost**, a free alternative to shots(dot)so. It’s a simple and efficient screenshot mockup generator that I initially created for personal use. To my surprise, after receiving some fantastic feedback, I decided it was time to share it with all of you!\n\n****Key Features:****\n\n- **Completely Free**: No hidden fees or subscriptions.\n  \n- **Mobile-Friendly**: Works seamlessly on smartphones, so you can create mockups on the go.\n  \n- **No Watermarks**: Your creations are yours—no branding from us!\n  \n- **No Login Required**: Jump right in without the hassle of signing up.\n  \n- **Quick and Easy UI**: Designed for speed and simplicity, making it perfect for anyone who needs a mockup fast.\n\nI built ScreenPost out of a need for a straightforward tool that didn’t complicate the process. If you’re looking for a way to create stunning mockups quickly, I’d love for you to give it a try at screenpost.vercel.app\n\nI’m eager to hear your thoughts and any feedback you might have. Let’s make this tool even better together! \n\nThanks for checking it out!\n"
    },
    {
        "id": "1fvk40p",
        "title": "A modern, social platform for bookworms.",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1fvk40p/a_modern_social_platform_for_bookworms/",
        "body": "Hey!\n\nThis started as a fun idea of mine over a year ago, and I'm just finally getting to bring it to life.\n\nAs someone whose been really into reading lately, I naturally started using Goodreads. I thought it was really clunky and slow, and I thought I could make something better.\n\nI know there already exists Goodreads alternatives, but they always felt like they lean too far toward the book tracking side of things or the social interaction side of things. I'm trying to find the sweet spot.\n\nIf anyone is interested in a modern, sleek alternative to Goodreads which includes:    \n\n- Twitter-like posting and social interaction  \n- book tracking and customizable bookshelf organization  \n- book rating and reviews  \n- public and private bookclubs, which you can create or join  \n- reading streaks and seasonal reading challenges  \n- privacy focused, free forever, with no ads\n\nThen join my waitlist here: [bookclub.social](http://bookclub.social)\n\nIt'll also help me gauge interest! Thanks people! :)"
    },
    {
        "id": "1kvzgxh",
        "title": "Im currently building an alternative to Milanote/Miro, what would you like to see?",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1kvzgxh/im_currently_building_an_alternative_to/",
        "body": "Hey r/SideProject  , since a month I have been building [kiboard.app](http://kiboard.app/) (the next-gen digital whiteboard)  \nas an alternative to Milanote and Miro, as Milanote is too slow with updates and doesn´t respond to customers demands properly and Miro only focusing on remote teams and is not great for personal use.\n\nSo my question would be: what would you like to see in KiBoard what others may lack?"
    },
    {
        "id": "1jt9am3",
        "title": "[Feedback Wanted] I built a microtask system that pays people for being useful, not employed",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1jt9am3/feedback_wanted_i_built_a_microtask_system_that/",
        "body": "I'm working on a system called HUE — the Human Utility Engine. Long-term, HUE isn’t just about tasks. It’s a blueprint for post-work life — a decentralized system where AI helps coordinate meaningful human contributions, and everyone gets rewarded based on usefulness instead of job status. We're testing the foundations now, but the vision is much bigger.\n\nThis is a side project I’ve been working on for a while. For the first phase, the idea is to coordinate small, useful tasks and pay people fairly for doing them — no resume or job title needed.\n\nI wanted to test: Can you build a dignity-first alternative to work that’s lightweight, transparent, and actually helpful?\n\nThere’s a prototype running now. You sign up, get a small useful task, and get paid. Tasks are short and flexible.\n\nWould love any feedback — on the concept, UX, trust, or anything else. I’m genuinely trying to build something people would want to use.\n\nCheck it out here: [https://forms.gle/vQcpn8Pr4xVwfLqs8](https://forms.gle/vQcpn8Pr4xVwfLqs8)  \nMore info: [https://www.notion.so/HUE-Human-Utility-Engine-1cba79a83d9d8068b783dae4702d5621?pvs=4](https://www.notion.so/HUE-Human-Utility-Engine-1cba79a83d9d8068b783dae4702d5621?pvs=4)\n\nPS: If you're excited by the bigger vision and want to support it, donation info is also available there.\n\n**EDIT (April 6):**  \nWe received 39 signups and have closed the form to stay within our $150 Phase 1 budget. Huge thanks to everyone who joined early — we’re matching contributors in waves and will open future rounds soon!"
    },
    {
        "id": "1hpkesm",
        "title": "GroupTrack — An open-source alternative to Life360",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1hpkesm/grouptrack_an_opensource_alternative_to_life360/",
        "body": "Hello everyone,\n\nI recently published an app called GroupTrack.  GroupTrack is here to simplify staying connected in the digital age. It helps you easily stay in touch with the people who matter most.\n\nWith GroupTrack you can\n\n* Create private groups (called “Groups”) for your family members and chat with them for FREE.\n* See the real-time location of family members on a private family map that’s only visible to your group.\n* Receive real-time alerts when family members arrive at or leave destinations (no more annoying “Where are you?” texts!)\n* See the location of stolen or lost phones\n\nLive App — [https://play.google.com/store/apps/details?id=com.canopas.yourspace](https://play.google.com/store/apps/details?id=com.canopas.yourspace)\n\nAndroid Source Code — [https://github.com/canopas/group-track-android](https://github.com/canopas/group-track-android)\n\nI understand that data privacy is important. Rest assured, **we will never sell your data**. We’ll be adding end-to-end encryption soon to make your data even more secure.\n\nWhile we’ll need subscriptions eventually (servers and map APIs aren’t free 😅), here’s the great part: since GroupTrack is open-source, you can always host it yourself for free if you prefer!\n\nSmall Request — If you like the idea or the app, please consider giving it a star on GitHub and downloading the app. Your feedback means a lot to us!"
    },
    {
        "id": "1hlrrhn",
        "title": "An Open source alternative to Gemini Deep Research",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1hlrrhn/an_open_source_alternative_to_gemini_deep_research/",
        "body": "All -\n\nOpen Deep Research is an open-source alternative to Gemini Deep Research, designed to generate comprehensive AI-powered reports from web search results.\n\n**How it Works**\n\nSearch Results: I use the Bing Search API to fetch results for your search term. You can then select the ones you are interested in.\n\nContent Extraction: JinaAI processes and extracts detailed content from the retrieved web pages.\n\nReport Generation: The app then generates a synthesized, customizable report based on your prompt and selected search results using Gemini.\n\nCustomize prompts and control search result selection for precise outputs. You can also update the model based on your preferences.\n\nPerfect for researchers, content creators, and anyone who wants quick, high-quality insights from online information.\n\nWould love your feedback!\n\n[Github](https://github.com/btahir/open-deep-research) | [Demo](https://opendeepresearch.vercel.app/)"
    },
    {
        "id": "1gxocu7",
        "title": "Built an alternative to Bitly",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1gxocu7/built_an_alternative_to_bitly/",
        "body": "Short links and QR codes are everywhere, but platforms like Bitly can feel outdated and come with limits that don’t make sense for the price, especially if you’re a startup or just doing your own thing. That’s where Qryptic comes in—a simple, modern approach that gives you more freedom with your links.\n\nHere’s what you can do for free:\n\n* Customize short links with your own custom domain.\n* Create QR codes for every link with your brand color.\n* Track clicks and scans to see how your links are performing.\n\nIf you’re looking for more advanced options, there are also paid plans with features like custom Open Graph metadata, link cloaking, geo-targeting, increased limits, and more.\n\nI'd love to hear what you think!\n\nHere's the website: [https://qryptic.io](https://qryptic.io)"
    },
    {
        "id": "1jvje3u",
        "title": "Looking for feedback on my side project: it’s an alternative to Product Hunt, made for indie makers",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1jvje3u/looking_for_feedback_on_my_side_project_its_an/",
        "body": "Hello Reddit! 👋\n\nI've had this side project for a while now called [Awesome Indie](https://awesomeindie.com/), it is an alternative to Product Hunt, made for indie makers.\n\nRecently, I decided to revamp the tech stack and give the UI/UX a much-needed refresh. I’d love to get some feedback from other makers and builders.\n\nYou can check it out at [awesomeindie.com](https://awesomeindie.com/), any thoughts or suggestions are super welcome!\n\nThanks!"
    },
    {
        "id": "1gj51pz",
        "title": "I'm still releasing apps and this is number 5 in the challenge for me , a friend and ChatGPT to build 20 apps in 20 weeks.",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1gj51pz/im_still_releasing_apps_and_this_is_number_5_in/",
        "body": "Alright, I know I said there wouldn’t be many Chrome extensions in my **20 Apps in 20 Weeks** challenge, but here we are again. I keep finding that these quick-to-access, lightweight tools are just *better* as Chrome extensions. So… deal with it.\n\nIntroducing **SendHub**: a tool I built specifically for the no-code power users – the folks who live and breathe in [Make.com](http://Make.com), Zapier, N8N, and other automation tools. If you’re a marketer, in operations, or doing SEO, and you’re always triggering workflows, you might know the pain of not having that *perfect* first app to kick things off. SendHub is here to solve exactly that.\n\n\n\n**What SendHub does**:\n\n• Lets you set up unlimited custom forms to send JSON data to any endpoint (CRM, video service, you name it).\n\n• Allows switching between forms, so you aren’t locked into a single setup.\n\n• Keeps everything local on your device with easy export/import options, perfect for sharing configurations with teams or clients.\n\n\n\nWhy did I make it? Because I needed a simple way to get data where I needed it, without building a huge app or waiting for something I’d have to sign up to. Plus, it’s free forever – no hidden paywalls or limits on usage.\n\n**This is app #5** of my challenge to release 20 apps in 20 weeks with a friend and ChatGPT. If you’re a power user in the no-code automation space and need a better way to get data moving into your workflows, try **SendHub** and let me know what you think.\n\n[https://sendhub.cc](https://sendhub.cc)\n\n[https://chromewebstore.google.com/detail/sendhub/cggdlflcedinlcmcnniblbndckpmegae?authuser=1&hl=en-AU](https://chromewebstore.google.com/detail/sendhub/cggdlflcedinlcmcnniblbndckpmegae?authuser=1&hl=en-AU)  \n\n\nhttps://reddit.com/link/1gj51pz/video/by8qqwg7zsyd1/player\n\n"
    },
    {
        "id": "1fvurm2",
        "title": "How do you manage customer feedback efficiently in your side projects? Looking for insights!",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1fvurm2/how_do_you_manage_customer_feedback_efficiently/",
        "body": "**TL;DR: I'm looking for insights on how you manage and analyze customer feedback efficiently.**\n\nAt my previous company, we were a small team of four product people, and we were swamped with feedback. We had to manually copy-paste everything into Notion, then organize, analyze, categorize, regroup, and prioritize it. This ended up consuming a big chunk of time for one person just to manage.\n\nI call this process \"Feedback Grooming\" — the initial steps are mostly admin tasks, but the real value comes from analyzing and extracting insights to prioritize the next actions.\n\nNow, I’m focusing on simplifying the administrative part and providing tools for bootstrappers and small teams to automate most of that, so they can focus on actually acting on the feedback.\n\nSo, here’s my question: How do you handle feedback? Specifically:\n\nWhat are your main sources of feedback?\n\n* How do you detect new feedback?\n* Where do you store it?\n* How do you process it?\n* What pain points do you encounter?\n\nAny insights would be super helpful! Thanks a lot!"
    },
    {
        "id": "1j9ga9i",
        "title": "Sync Your Android With Mac",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1j9ga9i/sync_your_android_with_mac/",
        "body": "I know many of us are looking for alternatives to Pushbullet, especially since its extension doesn't support newer browsers. I'm currently developing a new app that lets you send **notifications, answer calls, and more** between your Mac and Android devices.\n\n**Key Features:**\n\n* **No Browser Required:** Works independently of browsers.\n* **No Cloud Storage:** Your notifications stay private and local.\n* **Seamless Experience:** Designed to be more intuitive than Pushbullet.\n\nI've set up a landing page to gauge interest and gather feedback. If you're interested, please check it out and let me know what you think!\n\n**Special Offer:** As a token of appreciation for your valuable feedback, i'm happy offer lifetime access for free to those who provide the most insightful feedback during the beta phase. To stay updated and be considered for this offer, please leave your email address so we can notify you when we launch.\n\n[https://www.rabbit-link.app/](https://www.rabbit-link.app/)"
    },
    {
        "id": "1fhdmql",
        "title": "How do you manage all the paperwork?",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1fhdmql/how_do_you_manage_all_the_paperwork/",
        "body": "Hey guys,\n\nMy friends and I have a variety of different (technical) solutions for very niche problems, but with business possibility.\n\nWe are based in Germany and the paperwork here is complicated and scary, making us never pass the idea stage and we don’t have a costly tax adviser. (Starting with small budget)\n\nAfter asking the German subreddits, we have now a little roadmap, what to learn but it is still a bit overwhelming.\n\nBut I was wondering, how do you guys manage your own paperwork? Are the regulations in your country favorable to establish a business?\nWhat are some universal advice you can give us?\nAt what point should we hire someone?\n\nI‘m sry for my bad English and thanks in advance, for any answers!"
    },
    {
        "id": "1g9mqi1",
        "title": "Building an open-source alternative to Disqus. Looking for some input!",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1g9mqi1/building_an_opensource_alternative_to_disqus/",
        "body": "Hello everyone! I'm Safwan, a 23 year old software dev.\n\nI've spent way too much time trying to think of a \"game changing\" idea for a side project. I started off with a pastebin-like tool a few months back but got really busy with other stuff (work, personal life, etc.) and never got the motivation to pick it back up.\n\nAnyways, I decided to start building an alternative to Disqus. I don't intend to make money off of it. The biggest motivation for this project was so I could add comments to blog posts on my own site. Another factor was me applying a new software development pattern I recently started learning about. You might be thinking, why not use something like Disqus or another open source alternative to add comments to my site? Well it was mostly because I love building stuff, and this just has the added benefit of having created my website's elements from scratch (even though the site's style is HEAVILY inspired from some nice sites I found online).\n\nWith that being said, I wanted to know if anyone here has had any issues when adding a commenting feature on any of your projects. Even if you did, I would love to hear your thoughts!\n\n* What was the thing/s that you liked the most?\n* What was the thing/s that caused \"friction\"?\n* Is being open source and able to self-host a big factor for you guys?\n* Any things you wish you could do, but couldn't with the already existent solutions?\n\nI'm asking these questions just so I have more things to add to this project of mine other than just a way to store, manage and show comments. This is not to rope in users and money (although I would love to if it makes sense later on), but to solidify my skills as a dev.\n\nI don't have a name for it yet, but that's the least important thing for me right now lol. \n\nThank you so much for your time!"
    },
    {
        "id": "1iq0e9p",
        "title": "Launched 3 months ago here, Dailypings is live on Uneed!",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1iq0e9p/launched_3_months_ago_here_dailypings_is_live_on/",
        "body": "Hello everyone, \n\nAbout 3 months ago, I gave life to Dailypings thanks to you, right here! With no community on any network, I posted my alternative to HackerNews for IndieHackers, and the feedback was insane!\n\nSince then, I've had several freelance contracts, and great opportunities thanks to visibility. \nThere's even a Chinese version!\n\nIf you'd like to support the launch on Uneed, go here: https://www.uneed.best/tool/dailypings\n\nIt might just give the platform a 2nd boost in visibility :)"
    },
    {
        "id": "1j10y7k",
        "title": "Open Source alternatives to tools you use",
        "score": 3,
        "url": "https://www.reddit.com/r/SideProject/comments/1j10y7k/open_source_alternatives_to_tools_you_use/",
        "body": "I got tired of collecting open source projects in my chrome bookmarks so I decided to compile a curated list of:\n\n* Recently active projects on GitHub\n* Mostly dev tools (but also productivity, analytics)\n* Projects which are \"Alternative to X software\"\n* The ones I use myself (neon, plausible, umami, shadcn, lucide, OBS, calcom, supabase)\n\nSo far (I started working on it 5 days ago) I collected **over 50 tools** for example:\n\n\\- **5** alternatives to **Google Analytics**  \n\\- **3** alternatives to **Notion**  \n\\- **3** alternatives to **Firebase**\n\n... & much more\n\nMy bookmarks are finally empty 😃\n\n**Lists**:  \n[General List](https://alternativeoss.com/)  \n[Grouped by their alternative](https://alternativeoss.com/alternatives)\n\n**Contribute:** If you have a great open source tool you use (or own - that's fine) and think it should be added you can submit it on the page, put it in the comments below, create a new issue on the page repo (project itself is open source too!). I'd be glad if the open source project you suggest is also an alternative to popular proprietary software.\n\nSubmitting is free, website is free, no featured posts, no ads, only the useful tools you might want to try.\n\nI also tried to create a nice looking website with great UX, so for now you can sort and search for projects - all I could do in the last 5 days of little hackathon."
    }
]